{
    "about": "<h1>Mon parcours</h1>Après l’obtention d’un baccalauréat Scientifique option Sciences de l’ingénieur, j’ai pris la décision de poursuivre mes études à l’école supérieure d’informatique <strong>INTECH sud</strong> (repris par <strong>ESIEA</strong> en Juillet 2023) et plus précisément dans sa spécialité <strong>Ingénierie du logiciel</strong>. La finalité de ce parcours me permettra d’obtenir un diplôme d’<strong>Expert en Ingénierie du Logiciel</strong>.<br><br>C’est dans le cadre de ce cursus que je suis actuellement en alternance depuis plus d’un an dans l’entreprise Capgemini en tant que développeur.<br><br><h1>Mes valeurs</h1>Fort de ce parcours académique, mes valeurs professionnelles se sont solidement ancrées. Trois me guident au quotidien : <strong>l’innovation</strong>, <strong>l’adaptabilité </strong>et la <strong>curiosité</strong>. En effet, il est très important à mes yeux d’être constamment à la recherche de nouvelles idées et de solutions créatives pour aborder les défis technologiques d’aujourd’hui et de demain. Ce désir d’innover m’incite à m’éloigner de ma zone de confort afin d’explorer de nouvelles technologies et d'envisager des approches inédites pour résoudre des problèmes complexes. De plus, dans ce monde de l’informatique en constante évolution, cette démarche me pousse à m’adapter à de nouvelles tendances, méthodes de travail et outils. C’est notamment grâce à cette adaptabilité que j’arrive à assimiler rapidement de nouvelles informations et compétences et à les appliquer efficacement dans des environnements variés en m’adaptant par exemple aux différentes exigences et méthodologies de travail propres à chaque équipe. Enfin, c’est la <strong>curiosité</strong> qui m’encourage à toujours creuser plus profondément les sujets qui me passionnent pour pouvoir en comprendre les moindres détails.<br><br><br><h1>Mes qualités humaines</h1>Outre les valeurs qui m’importent beaucoup au quotidien, il est à mes yeux primordial de ne jamais oublier que l’on travaille au sein d’une équipe. Dans cette optique, il est aussi très important pour moi de développer mes qualités humaines. L'<strong>empathie</strong>, la <strong>collaboration</strong> et la <strong>persévérance</strong> sont des qualités qui me caractérisent. En effet, c’est lors de mes premiers projets durant mon cursus à INTECH que j’ai appris l’importance de l’<strong>empathie</strong>. Certains membres de l’équipe avaient du mal à assimiler des principes aussi rapidement que moi et se sentaient mal à l'aise en conséquence. J’ai mis un certain temps à comprendre leur situation et c’est seulement en me mettant à leur place que j’ai pu les aider à être plus sereins ce qui a permis à l’équipe de progresser beaucoup plus vite. De plus, ma capacité à collaborer efficacement s’est manifestée lorsque j’ai eu mon premier rôle de chef de projet. En effet, j'ai été confronté à une tâche difficile face à laquelle j’ai su mobiliser mes compétences et celles de mes coéquipiers pour sumonter l’obstacle. Finalement, la <strong>persévérance</strong> m’a guidé dans tous les projets auxquels j’ai pu participer. Quelle que soit la difficulté rencontrée, j’ai appris à ne pas baisser les bras et à toujours trouver une solution pour atteindre mes objectifs et ceux de l’équipe. Je crois fermement que le succès dans le développement informatique dépend en grande partie de la capacité à travailler en équipe et à comprendre les besoins des utilisateurs.<br><br><h1>Projet professionnel/personnel</h1>Ces qualités humaines sont au coeur de mon approche professionnelle et de mes ambitions futures. Tout au long de mon parcours, j’ai toujours été guidé par une passion pour <strong>l’innovation</strong> et la technologie. J’ai toujours été animé par le désir de contribuer au développement de solutions novatrices et la résolution de problèmes complexes. Que ce soit avant d’en faire mon activité principale en intégrant INTECH ou même durant mon cursus, ma passion n’a pas changé et n’a fait que se renforcer au fil de mes découvertes et de mes projets. A mon arrivée à l'école, il était difficile pour moi de définir précisément vers quel métier m'orienter. Le monde de l'informatique contenant une très large variété de métiers différents, il était compliqué avec mon peu d'expérience de savoir le métier idéal qui me correspondrait. Un aspect dont j'étais tout de même sur était que je souhaitais travailler dans le développement logiciel sans exigences spécifiques sur la technologie. <br><br>Ainsi, c'est lors de mon entrée dans le monde professionnel que j'ai pu me faire une idée précise. Lorsque j'ai signé mon contrat de stage avec Capgemini, je souhaitais travailler sur un projet concret et découvrir comment s'articulait son développement dans une entreprise. Cette première expérience m'a complètement convaincue et m'a confirmé que le développement logiciel était vraiment ce que je souhaitais faire. J'ai aussi eu l'occasion de découvrir une vision bien plus large de la gestion de projet en découvrant les notions de sécurité, de scalabilité, de gestion de données et bien d'autres encore. C'est pour ces raisons que j'ai pris la décision de me tourner vers le métier de <strong>développeur logiciel</strong> et à plus long terme, après avoir acquis plus d'expérience, je vise à devenir <strong>chef de projet</strong>. Avec un grand nombres de technologies et de projets différents, c'est un domaine qui me permet de ne jamais me lasser et de toujours apprendre.\n<br><h1>Centres d'intérêt</h1>En alignant mon projet professionnel avec mes passions, je trouve également l'inspiration dans mes centres d'intérêt personnels. Etant très attaché à <strong>l’innovation</strong>, j’effectue beaucoup de <strong>veille technologique</strong>.<br>C’est une activité que j’apprécie beaucoup car elle me permet de rester informé des dernières avancées technologiques mais aussi car elle nourrit ma <strong>curiosité</strong> et me motive à apprendre et explorer de nouvelles idées.<br><br>J’apprécie aussi la <strong>lecture</strong>, car elle me permet d’explorer différents univers et de développer ma réflexion critique. Elle m’offre également une pause bienvenue dans ma routine quotidienne en me permettant de m’évader et me détendre.<br><br>La pratique d'activités sportives telles que l’<strong>escalade</strong> me passionne car elle me pousse à me dépasser physiquement et mentalement. L'<strong>escalade</strong> est un défi constant où je suis confronté à mes limites, ce qui me permet de développer ma résilience, ma <strong>persévérance</strong> et ma capacité à relever des défis.<br><br>Enfin, jouer à des <strong>jeux vidéo</strong> est une activité que j’apprécie particulièrement car elle combine à la fois le divertissement et la stimulation intellectuelle. Certains jeux exigent des réflexes rapides, tandis que d'autres nécessitent une réflexion stratégique et une <strong>collaboration</strong> avec d'autres joueurs.",
    "imageSource": "images/about/profile.png"
    
}