{
    "projects": [
        {
            "image": "images/projects/echecs.png",
            "title": "Mat'moi ça",
            "bodyText": "Organisation d’un tournoi d’échec en ligne afin de reverser l’argent récolté à l’association UNICEF",
            "details": [
                {
                    "presentation": "<strong>Mat ‘moi ça</strong> est un tournoi d’échecs caritatif que j'ai organisé en semestre 4 dans une équipe de 5 étudiants lors de mon cursus à <strong>INTECH</strong> dans l’objectif de reverser les fonds récoltés à l’<a href='https://www.unicef.fr/'>UNICEF</a>. Notre choix s’est porté sur les échecs car c’est un jeu traversant les époques et qui revenait à la mode au moment de sa réalisation, c’est-à-dire lors du premier confinement. Cet engouement a aussi été nettement appuyé par la série « <a href = 'https://fr.wikipedia.org/wiki/Le_Jeu_de_la_dame'>Le jeu de la dame</a> » qui a suscité un grand intérêt du public pour ce jeu. C’était pour moi particulièrement excitant d’organiser un tournoi car j'avais découvert ce jeu de société peu de temps auparavant et un grand désir d’en découvrir toutes les facettes m’habitait.\n\nLe Fonds des Nations Unies pour l'enfance est une organisation internationale dédiée à <strong>la protection et au bien-être des enfants du monde entier</strong>. Créée en 1946, l'<a href='https://www.unicef.fr/'>UNICEF</a> travaille sans relâche pour garantir les droits fondamentaux de chaque enfant, notamment le droit à la santé, à l'éducation, à la protection et à la participation. Cette organisation, active dans plus de 190 pays, mène des projets essentiels pour lutter contre la malnutrition, améliorer l'accès à l'eau potable, fournir une éducation de qualité, et bien plus encore. Ces engagements m’avaient particulièrement touchés et c’est pour cela que j’étais très enthousiaste à l’idée de récolter des fonds pour cette association.",
                    "objectifs": "Les objectifs dans l’organisation de ce projet étaient multiples. Il fallait que je trouve des partenaires pour pouvoir financer le projet et récompenses du tournoi mais aussi trouver des personnalités pouvant en faire la promotion afin d’attirer plus de joueurs. De plus, il fallait que j'établisse une communication sur les réseaux sociaux autour de l’évènement. Finalement, la définition des règles du tournoi en lui-même était aussi un aspect important.\n\nLa principale difficulté que j'ai rencontrée durant la réalisation de ce projet était de faire face à mon manque d’expertise et de crédibilité dans le monde des échecs. En effet, il était difficile pour un étudiant inconnu de cet univers de trouver des sponsors et de gagner en visibilité.",
                    "etapes": "Il a donc été très important de bien définir les étapes de réalisation du projet. Je l'ai débuté par l'élaboration des règles du tournoi et le choix de la plateforme de jeu en ligne. Cette phase initiale a posé les bases de cet événement caritatif, garantissant son équité et sa compatibilité avec les objectifs. Il semblait important à mes yeux de trouver une plateforme qui pouvait à la fois donner un maximum de visibilité tout en restant en accord avec mes valeurs et celles que défendent l’<a href='https://www.unicef.fr/'>UNICEF</a>.<br><br><em>Mail de la plateforme chess.com confirmant leur soutien</em><div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Mat&#x27;moi%20ça/chesscom.png' alt='chesscom' style=' max-width: 90%; height: auto ' /></div>\n\nSimultanément, j'ai contacté des influenceurs du monde des échecs, cherchant leur soutien pour cette initiative. Leur implication était cruciale pour élargir la portée du tournoi. Ainsi, durant toute la phase de préparation, j’ai aussi eu l’occasion de contacter de nombreux influenceurs du monde des échecs par le biais d'un maximum de médias : par mail, twitter, Facebook, téléphone voire même en allant directement parler dans le chat de certains streamers pour se faire remarquer. C’était un challenge particulièrement compliqué au vu du manque de crédibilité évident qu’un étudiant peut avoir. Il m’a fallu adapter mon discours à chacun pour faire ressortir le projet et partager l'envie d’aider afin de convaincre un maximum d’influenceurs. Ces actions ont connu beaucoup de succès, parmi lesquels on peut retrouver <a href='https://twitter.com/ffechecs'>La Fédération Française des Echecs</a>, <a href='https://twitter.com/Dicomaniaque'>Dicomaniaque</a> ou encore <a href='https://twitter.com/Lampi0n_'>Lampion</a>.<br><br><em>Exemples de publications d'influenceurs que j'ai convaincus faisant la promotion du tournoi</em><div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Mat&#x27;moi%20ça/lampion.png' alt='client' style=' max-width: 50%; height: auto ' /><img src='images/projects/Mat&#x27;moi%20ça/dico.png' alt='client' style=' max-width: 50%; height: auto ' /></div>\n\nUne fois ces bases établies, j'ai pu animer le tournoi en le diffusant en direct sur <a href='https://www.twitch.tv/'>Twitch</a>. Cette diffusion en direct a permis d'engager le public, de susciter son intérêt, et de l'inciter à faire des dons en temps réel. Une fois de plus, c’était un exercice très intéressant de galvaniser un public et surtout de l’inciter à donner pour la bonne cause tout en rendant le tournoi intéressant à regarder. Personnellement, je l’ai pris comme un challenge. Étant de nature réservée, l’occasion était parfaite pour me dépasser et sortir de ma zone de confort.<br><br><em>Page de l'évènement sur la plateforme chess.com</em><div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Mat&#x27;moi%20ça/pageevent.png' alt='client' style=' max-width: 90%; height: auto ' /></div>\n\nTout au long de ce processus, la communication sur les réseaux sociaux a joué un rôle essentiel. Elle m'a permis de maintenir l'intérêt du public, de partager des mises à jour sur le tournoi et d'encourager la participation. Cette <strong>communication</strong> était un travail de fond très important durant le projet. Elle a permis d’une part de tenir la communauté créée informée des actualités du tournoi mais aussi d’attirer de nouveaux joueurs et donateurs potentiels. Ce n’était pas un exercice facile et il m'a été nécessaire de redoubler de créativité pour créer des posts engageants et des visuels attrayants.\n\nCe cheminement logique a conduit à la réussite du projet, en alliant stratégie, promotion, interaction en direct, et <strong>communication</strong> efficace pour soutenir une cause charitable.",
                    "acteurs": "Beaucoup d’<strong>acteurs</strong> ont été impliqués dans la réalisation de ce projet. Dans un premier temps, <a href='https://www.chess.com/'>chess.com</a>, la plus grande plateforme d’échecs en ligne que j'ai réussi à contacter et qui a aidé dans l’organisation, notamment en fournissant des comptes premium à offrir aux participants du tournoi.\n\nDans un second temps, plusieurs influenceurs que j'ai réussis à contacter ont accepté de mettre en avant l'événement auprès de leur communauté voire de diffuser le tournoi en direct afin d’augmenter le plus possible sa visibilité.\n\nFinalement, l’<a href='https://www.unicef.fr/'>UNICEF</a> a aussi été d'un grand soutien. Lors des premiers contacts avec eux pour leur présenter le projet, ils se sont tout de suite montrés très enthousiastes à l'idée de mettre en avant le projet sur leurs réseaux sociaux et ont publiés un petit article dans le journal sud-ouest.",
                    "resultats": "La réalisation de ce tournoi d’échecs caritatif a été un succès. En effet, l’association a été très satisfaite de mon implication mais aussi des résultats et des retours positifs des participants et des spectateurs. Grâce à mes efforts pour mobiliser des partenaires, promouvoir l’événement et organiser une diffusion en direct, l'évènement a permis de récolter des centaines d’euros de donations pour soutenir les projets de l’UNICEF à travers le monde. De plus, l'initiative a suscité l'intérêt de plusieurs acteurs clefs, notamment chess.com et plusieurs influenceurs qui ont renforcé l’impact de cette action. Quant à moi, j’ai eu l’occasion de découvrir le monde des échecs que je connaissais très peu à l’époque mais aussi d’en apprendre beaucoup plus sur l’association et ses différentes actions dans le monde entier. J’ai donc été d’autant plus heureux de constater ce succès.",
                    "lendemain": "A la suite du tournoi, j'ai maintenu une communication active pendant quelque temps sur les réseaux sociaux pour informer la communauté des résultats, remercier les participants et encourager des dons supplémentaires. J'ai également sollicité des retours d’expérience et des suggestions d’amélioration pour de futures initiatives.  L’UNICEF a par la suite partagé sa volonté de continuer ce genre d’actions et j'ai par conséquent transmis toute l’expérience que j'ai engrangé ainsi que les retours que j'ai eu eu pour qu’ils puissent adapter les futurs évènements. Aujourd’hui, l’UNICEF continue sa collaboration lors de tournois caritatifs dans le monde des échecs en essayant d’étendre toujours plus sa visibilité.",
                    "critique": "En rétrospective, bien que le tournoi ait été un succès, j’ai identifié plusieurs domaines d’amélioration potentiels. Notamment, mon plus grand regret est de ne pas avoir pu le réaliser en présentiel avec tous les joueurs réunis dans la même salle. Au vu des conditions sanitaires de l’époque, il n'était pas possible de réunir autant de personnes sans risquer de créer un cluster. Si c’était à refaire, je m’efforcerai de mieux anticiper les défis logistiques et de trouver des solutions pour garantir une expérience en présentiel. Malgré cette complication, je suis fier d’avoir su m’adapter pour permettre au tournoi d’avoir lieu mais aussi d’avoir réussi à entrer en contact avec des partenaires et de les avoir convaincu de m'aider. Cette expérience m’a permis d’apprendre l’importance de l’adaptabilité et de la persévérance ainsi que l’impact positif que je peux avoir pour soutenir des causes qui me tiennent à cœur."
                }
            ],
            "links": [
                {
                    "text": "Voir en détail",
                    "href": "/ProjectDetails?title=Mat'moi ça"
                }
            ],
            "tags": [
                "Gestion de projet",
                "Evenementiel",
                "Montage"
            ]
        },
        {
            "image": "images/projects/devmato.png",
            "title": "Devmato",
            "bodyText": "Site web pour le dermofacialisme. Le site vise à faire connaître ce métier et à mettre en relation les clients et les professionnels du dermofacialisme",
            "details": [
                {
                    "presentation": "<strong>Devmato</strong> est le nom d’un des projets que j’ai réalisé durant mon cursus à <strong>INTECH</strong> et notamment durant le semestre 4.\n\nLe projet visait à créer une plateforme web mettant en contact les professionnels du <strong>dermo-facialisme</strong> et leurs patients. Le <strong>dermo-facialisme</strong> désigne différentes pratiques de massages du visage et est pratiqué par des professionnels diplômés de la beauté. \n\nLe Product Owner de ce projet est à l’origine de cette pratique et son objectif principal était à cette époque de la démocratiser un maximum notamment en créant une plateforme simple d’accès et ergonomique pour accueillir un maximum de patients. L’idée était que lorsqu'un nouvel utilisateur souhaitait entrer en contact avec un professionnel, il pouvait tout simplement se rendre sur le site, créer un compte et ainsi sélectionner parmi la liste des professionnels celui qui convenait le plus à ses besoins. A partir de là, le patient avait accès aux disponibilités du professionnel et pouvait sélectionner une date qui lui convenait, ce qui générait ensuite automatiquement un événement dans son calendrier et créait une visioconférence pour un premier entretien entre les deux. \n\nLes <strong>dermo-facialistes</strong>, quant à eux, pouvaient profiter de la plateforme pour accroître drastiquement leur visibilité en permettant à de nombreux patients de voir leur profil mais aussi de simplifier grandement les démarches nécessaires pour organiser des rendez-vous. \n\nLe modèle économique était assez simple : il prennait un pourcentage du prix de la consultation. Une deuxième source de revenus vennait d’une autre partie du site qui est la formation. En effet, le product owner ayant créé la pratique, il désirait avoir sur le site une partie formation où il pourrait proposer ses services pour former de nouveaux <strong>dermo-facialistes</strong>.",
                    "objectifs": "Les <strong>objectifs</strong> de ce projet étaient donc multiples. Dans un premier temps, permettre aux professionnels de <strong>créer et afficher leur profil</strong> sur le site. Il me fallait ensuite permettre à chaque utilisateur de créer son compte et d’être mis en relation avec les professionnels. Finalement, il était important de donner les outils au Product Owner pour gérer le site en tant qu’administrateur.\n\nAu niveau de la partie des paiements, en tant qu’étudiant, il n’était pas possible de la réaliser et finalement en ce qui concerne les formations, l'objectif à ce niveau était surtout de poser les bases, le projet se concentrant vraiment sur la mise en relation des professionnels et des patients.",
                    "etapes": "Lors de ce projet, j'ai dû utiliser et me familiariser avec différentes technologies. Pour réaliser toute la partie <strong>front-end</strong> du site, c’est-à-dire toute la partie visuelle, c’est angular qui a rempli ce rôle et pour la partie <strong>back-end</strong> (tout ce qui concerne la gestion des données) c’est du <a href='/reactPortfolio/#/skilldetails/Java'>Java</a> qui a été utilisé. \n\nLors de la réalisation de ce projet, je me suis beaucoup concentré sur la partie <strong>back-end</strong>. En effet, mon rôle était principalement de gérer tout ce qui concernait la gestion de l’évènement à créer lorsqu' un <strong>dermo-facialiste</strong> et un <strong>patient</strong> souhaitaient se rencontrer. Cette partie du projet était cruciale mais aussi particulièrement complexe. \n\nUn aspect spécifique m’est apparu très rapidement avant même de commencer le développement. Réaliser de A à Z un calendrier spécialement pour le site aurait pris un temps colossal que je n’avais pas et il me paraissait logique que les utilisateurs préféreraient utiliser une application qu’ils connaissaient et utilisaient potentiellement déjà. C’est pour cela qu’après avoir étudié les différentes options possibles, j’ai eu l’occasion de les partager avec le Product Owner en lui présentant les avantages et inconvénients de chaque solution. La décision finale a été d’utiliser <strong>Calendly</strong>, une application permettant de gérer un calendrier et de générer des visioconférences. \n\nUne fois le besoin clairement identifié, j’ai pu prendre en charge la conception de l’architecture <strong>back-end</strong> de la plateforme. Cela comprenait la définition des modèles de données des utilisateurs, des professionnels et des rendez-vous ainsi que l’élaboration des différents services associés. Le code ci-dessous représente les deux services les plus importants que j'avais dû réaliser : celui du client et du professionnel. Ces services permettaient de réaliser toutes les actions CRUD (Create, Read, Update, Delete) essentielles au bon fonctionnement du site.<br><br><em>Services associés aux clients et professionnels permettant de récupérer leurs informations mais aussi d'en ajouter, modifier ou supprimer</em><br><div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Devmato/client.png' alt='client' style=' max-width: 90%; height: auto ' /></div><div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Devmato/dermo.png' alt='client' style=' max-width: 90%; height: auto ' /></div> \n\nL’intégration d’une <strong>API</strong> dans un projet était pour moi une totale découverte et a représenté une complexité majeure. Afin de pallier cette difficulté, j'ai d'abord entrepris une étude approfondie de la documentation fournie par <strong>Calendly</strong>. Cette étape m'a permis de comprendre en détail les fonctionnalités offertes par l'<strong>API</strong>, ainsi que les méthodes disponibles pour interagir avec celle-ci. \n\nEnsuite, j'ai développé des fonctionnalités permettant de récupérer les disponibilités des professionnels du dermo-facialisme à partir de leurs comptes <strong>Calendly</strong> et de les afficher sur leurs profils. Pour ce faire, j'ai utilisé les <strong>endpoints</strong> fournis par l'entreprise pour récupérer les créneaux horaires disponibles, en prenant en compte les paramètres tels que la durée des rendez-vous et les périodes de disponibilité spécifiées par les utilisateurs. \n\nUne fois les disponibilités récupérées, j'ai mis en place un système de <strong>synchronisation régulière</strong> pour garantir que les informations affichées sur la plateforme soient toujours à jour. J'ai utilisé des tâches planifiées pour exécuter automatiquement des requêtes vers l'<strong>API</strong> à intervalles réguliers, en récupérant les dernières disponibilités et en mettant à jour la base de données de la plateforme en conséquence. <br><br><em>Fonction permettant de récupérer les disponibilités de l'utilisateur connecté en contactant l'API</em><br> <div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Devmato/getEvents.png' alt='client' style=' max-width: 100%; height: auto ' /></div>\n\nEn parallèle, j'ai développé des fonctionnalités permettant aux utilisateurs de planifier des rendez-vous en ligne avec les professionnels du dermo-facialisme directement depuis la plateforme. Lorsqu'un utilisateur sélectionnait un créneau horaire sur le profil d'un professionnel, un processus automatisé était lancé pour créer un événement <strong>Calendly</strong> correspondant à ce rendez-vous. Cela impliquait de formater correctement les données et de les envoyer à l'API <strong>Calendly</strong> via des <strong>requêtes HTTP</strong>, en veillant à ce que toutes les informations nécessaires soient transmises avec précision. Le code ci-dessous montre la gestion des disponibilités. C'était un aspect particulièrement compliqué qui nécessitait à la fois de récupérer les informations entrées par l'utilisateur dans le formulaire, vérifier en contactant l'API à l'aide du token qu'il est bien possible d'ajouter cette disponibilité et finalement l'ajouter dans la base de données et sur le calendrier de l'utilisateur sur Calendly tout en gérant toutes les potentielles erreurs durant le processus.<br><br><em>Fonction gérant l'ajout de nouvelles disponibilités en base de données</em><div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Devmato/dispo.png' alt='client' style=' max-width: 90%; height: auto ' /></div> \n\nEnfin, j'ai développé des mécanismes de gestion des erreurs et de gestion des exceptions pour garantir que le processus d'intégration avec <strong>l'API Calendly</strong> se déroule de manière <strong>fluide et fiable</strong>. J'ai mis en place des mécanismes de journalisation robustes pour enregistrer les interactions avec l'API, ce qui m'a permis de diagnostiquer rapidement les problèmes éventuels et de les résoudre efficacement.\n\nJ’ai également joué un rôle actif dans les <strong>tests et le débogage</strong> des différentes fonctionnalités de l’application en réalisant des <strong>tests unitaires et d’intégration</strong> pour identifier et résoudre les problèmes rencontrés. J’ai également pu rédiger une documentation technique complète décrivant l’utilisation de l’architecture <strong>back-end</strong> de la plateforme ainsi que des API et services disponibles.\n\n<em>Code gérant l’utilisation de l’API Calendly</em>",
                    "acteurs": "Plusieurs acteurs ont été impliqués lors de ce projet. Dans un premier temps, je me suis assuré du développement de l'application avec mon équipe. De plus, le Product Owner a toujours su se rendre disponible malgré son emploi du temps chargé pour aider à appliquer au mieux sa vision.",
                    "resultats": "Les résultats du projet ont été très positifs pour toutes les parties prenantes. En effet, suite à la livraison de la solution, le Product Owner m'a partagé sa grande satisfaction pour mon professionnalisme et la qualité du travail produit. Il a notamment insisté sur le suivi très qualitatif du projet qui lui a permis d’avoir une très bonne vision des différentes avancées. Il disposait donc d’une maquette fonctionnelle qui lui a permis de visualiser concrètement le projet qu’il avait toujours voulu réaliser. Quant à moi, cette expérience m’a permis de développer grandement mes compétences en gestion de projet mais aussi mes capacités techniques car j’ai pu me plonger beaucoup plus profondément que dans mes expériences précédentes sur l’aspect back-end.\n\n<em>Arborescence du projet</em>",
                    "lendemain": "A la fin du projet, le Product Owner disposait donc d’une maquette fonctionnelle lui permettant de mettre en relation ses patients avec les professionnels du dermo-facialisme. Étant très satisfait du résultat, il a continué immédiatement le projet en confiant la suite à une nouvelle équipe. En effet,le projet se passant dans un cadre scolaire, il n’était pas possible pour des étudiants de réaliser les parties du site associées aux paiements. Une fois la plateforme entièrement finalisée, l’objectif est de l’ouvrir dans un premier temps dans un cadre assez restreint pour s’assurer que tout se déroule sans problème pour éventuellement finir par la rendre accessible au grand public.",
                    "critique": "Je retiens beaucoup d’enseignements de ce projet. En effet, c’était pour moi la première fois que j’étais confronté à un projet aussi complexe techniquement. Ces défis techniques et organisationnels étaient difficiles mais surtout stimulants et m’ont poussé à me dépasser afin de trouver des solutions créatives. Je suis fier d’avoir su adopter une approche pragmatique face à ces difficultés et d’avoir maximisé l’efficacité de la solution tout en respectant les contraintes de temps et de ressources. Cette expérience m’a également permis de découvrir un nouveau domaine d’application et d’en comprendre les enjeux, ce qui a élargi ma perspective et mes compétences professionnelles."
                }
            ],
            "links": [
                {
                    "text": "Voir en détail",
                    "href": "/ProjectDetails"
                }
            ],
            "tags": [
                "Java",
                "SQL",
                "Git",
                "Javascript",
                "Architecture web",
                "Gestion de projet",
                "Agilité"
            ]
        },
        {
            "image": "images/projects/hypotech.PNG",
            "title": "Hypotech",
            "bodyText": "Application Android simplifiant le travail administratif des agents immobiliers",
            "details": [
                {
                    "presentation": "Hypotech est le nom d’un des projets que j’ai réalisé durant mon cursus à INTECH et notamment durant le semestre 5 dans une équipe de 5 étudiants.\n\nLe projet visait à créer une application mobile simplifiant les processus administratifs d’une transaction immobilière. Le projet était commandité par Fabien Dalléas, un agent immobilier confirmé avec 16 ans d’expérience. Il souhaitait proposer une solution innovante pour aider les agents immobiliers et les notaires à changer radicalement et profondément l’environnement commercial afin d’offrir une meilleure expérience client et une façon pour les professionnels d’augmenter leur chiffre d’affaires. \n\nEn effet, les professionnels de l’immobilier sont confrontés à des contraintes administratives de plus en plus nombreuses pour pouvoir assurer la mise en vente, la vente ou la location de biens immobiliers. Cela est lié au renforcement de la réglementation et à des lois successives, notamment les lois <a href='https://www.ecologie.gouv.fr/loi-portant-evolution-du-logement-lamenagement-et-du-numerique-elan'>ELAN</a> et <a href='https://www.ecologie.gouv.fr/loi-lacces-au-logement-et-urbanisme-renove-loi-alur#:~:text=La%20loi%20pour%20l'acc%C3%A8s,l'innovation%20et%20la%20transparence.'>ALUR</a> récemment adoptées. L’application visait à simplifier leur quotidien en gérant pour eux l’aspect administratif lié à la vente des biens immobiliers et elle devait être déployée dans un premier temps dans les Landes et le Pays Basque. C’est après un benchmark des solutions déjà existantes dans le milieu que j'ai constaté que ce que proposait le commanditaire n’existait pas sur le marché et pourrait réellement apporter quelque chose de nouveau et utile. \n\nL’objectif était donc de créer une application Android dont la fonction principale était de simplifier le travail administratif des professionnels de l’immobilier, mais aussi des particuliers qui pouvaient gagner beaucoup de temps. ",
                    "objectifs": "Le développement de l’application se séparait en 3 axes principaux. Dans un premier temps, permettre aux professionnels et aux particuliers de numériser et envoyer leurs fichiers ainsi que de vérifier leur progression. Ils pouvaient ainsi suivre l’avancement de leurs dossiers avec les principales échéances. Il fallait aussi, dans un second temps, trouver un design sans marque en discutant régulièrement avec le commanditaire. Avec un design sans imposer de logo ou de charte d’une marque en particulier, chaque société immobilière peut appliquer son logo tout en traitant avec ses clients. Finalement, il fallait permettre à des administrateurs de modérer l’application en accordant des autorisations spécifiques aux utilisateurs et effectuer des actions de modération comme des suppressions de comptes…. ",
                    "etapes": "La première étape de la réalisation de ce projet est probablement la ou l’une des plus importantes : l’organisation et la préparation. En effet, j'avais à ce stade une idée générale de la manière dont l’application devait être réalisée, mais je manquais d’informations cruciales pour commencer le développement. C’est pour cela que j’ai pris la décision très tôt de régulièrement communiquer avec le commanditaire du projet afin de connaître au mieux son besoin. Après notre première réunion, j'ai pu élaborer le premier Product Backlog regroupant les principales fonctionnalités de l’application. En méthode Scrum, Un product backlog est une liste dynamique et priorisée des fonctionnalités, des améliorations et des corrections de bogues à réaliser pour un produit donné. C'est essentiellement une liste de tâches à accomplir, organisée par ordre de priorité et régulièrement mise à jour pour refléter les besoins changeants du projet.<br><br><em>Prodcut Backlog élaboré après les premières réunions</em><br><br> <div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Hypotech/backlog.jpg' alt='backlog' style=' max-width: 90%; height: auto ' /></div>\n\nUne fois le Product Backlog prêt et les fonctionnalités réparties, j'ai pu commencer le développement de l’application mobile sur une technologie que j’ai découvert lors de ce projet : Android. Ce fut une difficulté majeure car l’application était particulièrement complexe dans sa réalisation et il a été nécessaire que je m'adapte le plus rapidement possible afin de trouver des solutions techniques pour mettre en place les souhaits du commanditaire.\n\nEn complément de mes responsabilités de Scrum Master, j’ai aussi contribué au développement technique du projet. Mon rôle dans le développement s’est principalement axé sur une fonctionnalité centrale : la gestion des dossiers immobiliers. Afin de réaliser cette tâche, je me suis dans un premier temps concentré sur la partie front-end en me familiarisant avec les outils proposés par Android Studio. J’ai donc eu l’occasion de créer un visuel représentant chaque dossier possédé par l’utilisateur et j’ai aussi pris l’initiative d’ajouter une barre de progression autour qui permettait de visualiser l’avancée du dossier. La page était donc constituée des dossiers de l’utilisateur générés dynamiquement mais aussi d’un calendrier partagé avec les différentes parties prenantes du dossier qui avait pour but de récupérer les rendez-vous fixés pour les afficher directement, évitant ainsi à l’utilisateur de se rendre dans chaque dossier pour connaître les dates importantes.<br><br><em>Arborescence liée à la gestion des dossiers</em><br><br> <div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Hypotech/arbo.png' alt='arbo' style=' max-width: 50%; height: auto ' /></div><br><br>Après avoir terminé de réaliser les différents visuels, je me suis concentré sur l’aspect Back-End. Il s’agissait ici de définir en base de données toutes les informations que devait contenir un dossier, informations que j’ai obtenues en communiquant régulièrement avec le commanditaire pour les valider. Cette partie en base de données s’est avérée plus complexe que prévue car j’ai dû gérer les nombreuses dépendances entre les différentes parties prenantes des dossiers mais aussi gérer la création des événements lors de rendez-vous. Enfin, j’ai eu l’occasion de faire le lien entre la partie Front-End et Back-End en réalisant les appels qui venaient récupérer les informations présentes en base données pour les répercuter sur les visuels de l’application.<br><br><em>Fonction gérant la création d'un nouveau dossier</em><br><br> <div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Hypotech/creerDossier.png' alt='creerDossier' style=' max-width: 90%; height: auto ' /></div>\n\nLa dernière étape a été la conception des documentations utilisateurs et administrateurs afin d’expliquer toutes les fonctionnalités de l’application.\n\nFinalement, un aspect important que j'ai eu à gérer tout au long de ce projet a été la communication avec le commanditaire. En effet, en tant que Scrum Master, il a fallu que je m’occupe d’organiser les différentes réunions pour ajuster le projet aux demandes de Fabien Dalleas tout en essayant de le canaliser pour que tout reste réalisable dans les délais imposés. C’était un exercice particulièrement difficile pour moi, il arrivait parfois que d’une réunion à l’autre il change complètement d’avis sur certaines fonctionnalités, m’obligeant à être assez ferme, ce qui n’a pas toujours été facile pour lui d’accepter.\n\n<em>Ci-dessous les pages de gestion et de détails des dossiers que j'ai réalisées</em>",
                    "acteurs": "Plusieurs acteurs ont été impliqués dans de ce projet. Dans un premier temps, je me suis assuré du développement de l'application avec mon équipe. De plus, Fabien Dalléas, le commanditaire, a toujours su se rendre disponible malgré son emploi du temps chargé pour m'aider à appliquer au mieux sa vision.",
                    "resultats": "Le projet a pu être mené à son terme avec une version fonctionnelle de l’application qui a pu être remise au commanditaire. Malgré les nombreux retours positifs tout au long du projet, il n’était pas entièrement satisfait de la version finale. En effet, il s’est aperçu qu’il souhaitait totalement changer la direction visuelle du projet.",
                    "lendemain": "Suite à la dernière livraison, ne pouvant continuer en tant qu'étudiant, le commanditaire a pris la décision de continuer avec une équipe de professionnels à développer son projet en changeant totalement le visuel prévu initialement. Il compte par la suite se servir de l’application pour présenter le concept à des investisseurs potentiels qui trouveraient un intérêt dans son projet innovant.",
                    "critique": "Je retire beaucoup d’enseignements de ce projet. Sur le plan personnel, celui-ci m’a permis d’apprendre le rôle et les responsabilités d’un Scrum Master et ainsi de développer mes compétences en gestion d’équipe et communication tout en découvrant le développement Android. En effet, c’était pour moi la première fois que j'endossais le rôle de Scrum Master et j’ai eu l’occasion de comprendre la difficulté des nombreuses responsabilités que cela représentait. J’ai notamment été très affecté par le revirement soudain du commanditaire. Tout au long du projet, j’ai essayé d’appliquer de la manière la plus rigoureuse possible la méthode agile en passant par des livraisons régulières des avancées afin d’avoir un maximum de retours et être sûr d'aller dans le bon sens. Ses retours étaient toujours positifs sur ces avancées et par conséquent j’étais confiant sur la direction à prendre. Il m'a par la suite expliqué que le problème ne venait pas du travail réalisé mais plutôt d’une prise de conscience de sa part et que le projet l’avait aidé à s’orienter plus précisément et m'a remercié pour mon implication.\n\nA posteriori, cette expérience a été très enrichissante et  je suis fier de la manière dont j'ai géré le projet en tant que chef d'équipe. J’ai réussi à appliquer la méthode agile de manière rigoureuse et efficace malgré mon niveau débutant durant la réalisation du projet. Cependant, je me suis aperçu avec du recul que j'aurais dû travailler plus en profondeur la vision du commanditaire au début du projet en définissant précisément son besoin et ainsi éviter des instructions vagues. Si je devais refaire ce projet aujourd’hui, je serai bien plus ferme lors de l’élaboration du Product Backlog en clarifiant les attentes et en veillant à ce que les objectifs soient alignés avec les contraintes de temps et de ressources."
                }
            ],
            "links": [
                {
                    "text": "Voir en détail",
                    "href": "/ProjectDetails?title=Hypotech"
                }
            ],
            "tags": [
                "Java",
                "SQL",
                "Git",
                "Agilité"
            ]
        },
        {
            "image": "images/projects/AgriDax.PNG",
            "title": "Agri'Dax",
            "details": [
                {
                    "presentation": "Agri Dax est une formation que j'ai organisée avec mon groupe de semestre 3 lors de mon cursus à <strong>INTECH</strong> dans l’objectif de former les membres de l’<strong>AMAP</strong> de Dax à l’utilisation d’un nouveau logiciel de gestion qu’ils souhaitaient utiliser. Il s’agissait donc d’expliquer à tous les utilisateurs potentiels du logiciel son fonctionnement mais aussi d’aider l’<strong>AMAP</strong> à se développer et à attirer de nouveaux adhérents.\n\nUne <strong>AMAP</strong> est une Association pour le Maintien d'une Agriculture Paysanne, qui est un partenariat entre des agriculteurs locaux et des consommateurs. Le concept a été créé en France dans les années 2000. L'objectif principal d'une <strong>AMAP</strong> est de soutenir l'agriculture locale, durable et souvent biologique, tout en renforçant les liens entre les producteurs et les consommateurs.\n\nLe fonctionnement d'une <strong>AMAP</strong> est basé sur un engagement mutuel. Les consommateurs, appelés « amapiens », s'engagent à acheter une part de la production agricole d'un producteur local sur une période définie (généralement une saison). En échange, le producteur s'engage à fournir une variété de produits frais et locaux, souvent des fruits, légumes, viandes, œufs, etc.\n\nLes avantages d'une <strong>AMAP</strong> sont multiples. Pour les consommateurs, cela signifie avoir accès à des aliments frais, de saison et locaux. Ils soutiennent également une agriculture respectueuse de l'environnement. Du côté des agriculteurs, l'<strong>AMAP</strong> leur offre une source de revenus plus stable, la possibilité de se concentrer sur une production de qualité plutôt que sur la quantité, et une relation directe avec les personnes qui consomment leurs produits.\n\nL’<strong>AMAP</strong> de Dax applique donc ce modèle mais s'est aperçu au fil du temps qu’ils avaient du mal à attirer de nouveaux adhérents et étaient en retard sur les autres <strong>AMAP</strong> de la région. Les gérants de l'association ont donc cherché ce qui les différencaient des autres AMAP et se sont rendu compte notamment qu’elles utilisaient un logiciel spécifique pour la gestion des stocks. Ils ont donc décidé de nous solliciter afin d’aider tous les profils à se familiariser avec le logiciel mais aussi dans un deuxième temps à leur fournir un benchmark des différentes <strong>AMAP</strong> de la région afin de les aider.",
                    "objectifs": "Les objectifs lors de ce projet étaient donc multiples. Il fallait dans un premier temps que je me familiarise avec le logiciel puis concevoir une formation de A à Z qui serait compréhensible par tout type de profil. De plus, un objectif important était de déterminer par quels moyens l’AMAP pouvait améliorer son organisation, aspect passant notamment par la réalisation d’une étude comparative des différentes associations de la région.\n\nLors de la réalisation de ce projet, il m'a fallu faire face à une difficulté particulière qui était ma méconnaissance totale du sujet. En effet, je ne possédais aucune connaissance sur les AMAP, leur fonctionnement voire même leur existence avant de débuter le projet. Il me fallait donc établir très vite un plan solide pour pallier ces faiblesses.",
                    "etapes": "En tant que chef d’équipe, il me semblait essentiel de bien déterminer les étapes à entreprendre pour réaliser la mission. Dans un premier temps, avant même de me pencher sur la réalisation de la formation, il a fallu impérativement emmagasiner un maximum d’informations sur l’association en elle-même. C'est pour ces raisons que j’ai décidé de lancer  une collecte d’informations multiples. Cette décision a permis à la fois de travailler auprès de l’association pour leur poser des questions, effectuer un travail de recherche mais aussi de progresser sur la compréhension et la maîtrise du logiciel sur lequel la formation allait être réalisée. Grâce à cette organisation que j’ai mise en place très tôt dans le projet, lors de la mise en commun des informations récoltées, j'ai pu pallier le manque de connaissances sur le sujet en un temps record.<br><br><em>Extrait du document rédigé après étude approfondie du logiciel</em><div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Agri&#x27;Dax/actions.png' alt='actions' style=' max-width: 90%; height: auto ' /></div>\n\nA partir de cette étape, il était crucial de commencer à travailler sur l’étude comparative des différentes associations de la région. C’est pour cette raison que j’ai pris l’initiative de contacter directement chaque AMAP de la région pour en apprendre davantage sur leurs différents modes de fonctionnement. C’était pour moi un exercice difficile étant de nature assez réservé mais également une expérience très enrichissante qui m’a permis de récolter beaucoup d’informations mais aussi de mettre en contact les associations entre elles. Ainsi, elle se sont aperçues au fil de nos conversations que certaines étaient très isolées. En parallèle de ce travail de contact, j’ai aussi supervisé les recherches et finalement récolté assez de statistiques pour comparer les AMAP sur plusieurs critères : la communication (réseaux sociaux…), l’utilisation du logiciel de gestion, le nombre d’adhérents et de producteurs et son évolution au fil du temps ainsi que le prix d’adhésion. Ainsi, il a été possible d'interpréter toutes ces informations et de déterminer des moyens pertinents pour l’AMAP de Dax de développer ses activités et attirer de nouveaux adhérents.<br><br><em>Extrait de l'étude comparative regroupant les informations récoltées auprès des AMAP dans un graphique</em><div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Agri&#x27;Dax/comparaison.png' alt='client' style=' max-width: 90%; height: auto ' /></div>\n\nTout au long de ce travail de recherche, j’ai travaillé sur la réalisation de la formation sur le logiciel de l’association. Ainsi, j’ai eu l’occasion d'oeuvrer sur la structure de la formation et son contenu. Il s’agissait de former chaque catégorie d’utilisateur à l’utilisation de toutes les fonctionnalités du logiciel : les amapiens (adhérents de l’association), les producteurs (qui fournissent les produits) et les administrateurs. Il était particulièrement complexe mais intéressant d’adapter le discours à chaque catégorie d’utilisateur, les âges des personnes formées allant d'une vingtaine d’années à plus de 75 ans.<br><br><em>Sommaire du support de présentation de la formation</em><div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Agri&#x27;Dax/sommaire.png' alt='client' style=' max-width: 90%; height: auto ' /></div>\n\nPour finir, j'ai réalisé directement la formation. Le projet se déroulant en pleine période de COVID, j’ai dû organiser la formation entièrement en visioconférence. C’était un exercice très intéressant et nouveau d’animer une formation. En effet, contrairement aux oraux auxquels j’avais l’habitude de participer, il fallait ici être très pédagogue et être prêt à répondre à n’importe quelle question venant des apprenants.\n\nAvec une gestion et une organisation efficace de ce projet, j’ai su le mener vers la réussite.\n\n<em>extrait de l'étude comparative et du diaporama de la formation</em>",
                    "acteurs": "Plusieurs acteurs ont été impliqués tout au long du projet. Dans un premier temps, l’<strong>AMAP</strong> de Dax qui tout au long du projet a toujours été disponible pour répondre aux questions et m'éclairer sur leur fonctionnement.\n\nDe plus, les nombreuses <strong>AMAP</strong> de la région ont toujours su être ouvertes et très enthousiastes à l’idée d’aider l’<strong>AMAP</strong> de Dax à se développer. Grâce aux nombreux contacts que j'ai pu avoir lors du projet, j'ai permis à l’association de Dax de se rapprocher d’elles car elle était assez isolée avant le projet.",
                    "resultats": "L’AMAP de Dax a exprimé une grande satisfaction à l’égard du travail fournit en soulignant la qualité de la formation et l'utilité de l’étude comparative réalisée. L’association disposait donc d’outils concrets pour améliorer son fonctionnement et attirer de nouveaux adhérents. Le travail fourni a été bien accueilli et a eu un impact positif comme j’ai pu le constater en parcourant les réponses au questionnaire de satisfaction que j’avais pu partager avec les apprenants de la formation ainsi que les membres de l’association. Personnellement, cette expérience m’a permis de découvrir le fonctionnement très intéressant des AMAP et d’apporter une contribution significative à un projet ayant un impact réel sur la communauté locale.\n\n<em>Questionnaire de satisfaction</em>",
                    "lendemain": "A la suite du projet, l’AMAP de Dax a pu dans un premier temps mettre en place une stratégie en se basant sur les outils, connaissances et conseils que le projet a pu leur apporter afin de se développer. Aujourd’hui, vérifiant régulièrement l’avancée de l’AMAP, j’ai pu constater ses progrès tant en nombre d’adhérents que dans l’optimisation de son organisation. De plus, l'association a su rester en contact avec ses semblables dans la région afin qu’elles puissent s'entraider et elle continue sa remise en question constante de ses méthodes avec pour objectif de toujours s’améliorer.",
                    "critique": "Avec du recul, je suis satisfait de mon rôle de chef de projet et de ma contribution. Malgré le défi initial de ma méconnaissance du sujet, j’ai su organiser efficacement le travail et mobiliser l’équipe pour apporter une véritable aide à l’AMAP de Dax. Ce fut également un projet très enrichissant pour moi car il m’a permis de sortir de ma zone de confort en développant mes compétences en communication et en pédagogie. Mon seul regret sur ce projet est de ne pas avoir pu contacter plus d’associations, il aurait été intéressant de se pencher sur d’autres régions qui pourraient avoir un fonctionnement très différent. Hélas, dans les délais restreints auxquels je devais faire face je n’ai pas eu l’occasion d’exploiter plus cet aspect."
                }
            ],
            "bodyText": "Former les membres de l'assocation AMAP à l'utilisation d'un logiciel facilitant leur travail",
            "links": [
                {
                    "text": "Voir en détail",
                    "href": "/ProjectDetails?title=Agri'Dax"
                }
            ],
            "tags": [
                "Gestion de projet",
                "Evenementiel",
                "Communication",
                "Montage"
            ]
        },
        {
            "image": "images/projects/capge.png",
            "title": "Maintenance applicative",
            "bodyText": "Maintenance applicative en tant que développeur chez Capgemini",
            "details": [
                {
                    "presentation": "C’est grâce à ce projet que je suis entré pour la première fois dans le monde professionnel en rejoignant Capgemini. Cette entreprise est un des leaders mondial dans le conseil, le service informatique et la transformation numérique. J’ai rejoint Capgemini Bordeaux afin de travailler pour le client <strong>France Travail</strong> qui est un établissement public à caractère administratif, chargé de l’emploi en France, créé le 20 décembre 2008. Il est issu de la fusion de deux réseaux : <strong>l’Agence Nationale pour l’emploi</strong> (ANPE) et l'Association pour l’Emploi Dans l’Industrie et le Commerce (ASSEDIC). Il a trois fonctions essentielles : l’accompagnement au retour à l’emploi, l’indemnisation des demandeurs d’emploi et la mise en relation des entreprises et des candidats demandeurs d’emploi.\n\nAfin de faire évoluer son Système d’Information (SI), la direction de <strong>France Travail</strong> confie depuis plus de 20 ans à Capgemini une partie de la maintenance corrective et évolutive de ses applications. Capgemini fournit d’une part des prestations dans les locaux du client à Gradignan, par l’intermédiaire des collaborateurs, mais a aussi déployé des équipes dans les locaux de Capgemini à Mérignac.\n\nJ’ai pour ma part intégré les équipes travaillant sur le projet <strong>France Travail</strong> sur le site de Mérignac et plus précisément dans le domaine Indemnisation. Celui-ci est d’une importance stratégique capitale pour <strong>France Travail</strong>. En effet, ce sont tous les jours des millions de personnes qui reçoivent des courriers pour de multiples motifs, ce qui engendre par conséquent un énorme système qui doit gérer l’envoi et l’évolution de ces dits courriers. En plus de la gestion des courriers envoyés aux demandeurs d’emploi, le domaine s’occupe aussi d’une partie de l’application <strong>Aude</strong> permettant aux conseillers <strong>France Travail</strong> de gérer les personnes qui leur sont assignées.",
                    "objectifs": "Les objectifs dans le cadre de ce projet sont multiples. Il s’agit d’améliorer l’application <strong>Aude</strong> et les processus de gestion des courriers envoyés aux demandeurs d’emploi en répondant et en s’adaptant aux demandes du client tout en assurant une collaboration fluide et efficace entre les différentes équipes.",
                    "etapes": "Les tâches que je réalise sur ce projet proviennent de demandes du client qui souhaite créer ou faire évoluer des fonctionnalités. Mon rôle est donc de traiter ces demandes en réalisant le développement puis en testant la solution et finalement en livrant la nouvelle version de l’application sur les environnements de production.\n\nUne tâche typique que j’ai eu à réaliser était la mise en place d’un nouvel écran sur l’application <strong>Aude</strong> qui utilise une ancienne version de <a href='/reactPortfolio/#/skilldetails/Java'>Java</a> (la 6) et le <strong>JSPF</strong> pour gérer la partie front-end. Le <strong>JSPF</strong> (JavaServer Pages Fragment) est un type de fichier utilisé dans le développement web Java. Il est utilisé dans le cadre des technologies JSP (JavaServer Pages) pour créer des fragments de pages web réutilisables. Contrairement à un fichier JSP standard qui représente une page web complète, un fichier <strong>JSPF</strong> représente un fragment de contenu qui peut être inclus dans d'autres pages JSP ou <strong>JSPF</strong>.<br><br><em>Arborescence des fichiers jspf nécessaires au bon fonctionnement du nouvel écran</em><div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Maintenance%20applicative/arbo.png' alt='client' style=' max-width: 90%; height: auto ' /></div> Ce nouvel écran avait pour objectif de permettre l’affichage d’un certain type de courrier sur une liste dédiée qui serait accessible par le conseiller qui pourrait en ajouter ou en supprimer si nécessaire. Afin de réaliser cette évolution, j'ai dû faire face dans un premier temps à une des plus grosses difficultés de ce projet : analyser l’existant pour comprendre comment intégrer la nouvelle fonctionnalité. En effet, avec plus de 20 ans d’historique, de nombreux développeurs ont participé au projet et ont apporté leurs propres modifications et par conséquent au fil du temps beaucoup de savoir s’est perdu et il est donc souvent compliqué d’analyser et de comprendre ce qui a été fait par le passé.<br><br><em>fonction initialisant la liste des courriers et récupérant toutes les données nécessaires</em><div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Maintenance%20applicative/init.png' alt='client' style=' max-width: 90%; height: auto ' /></div>\n\nUn autre aspect particulièrement important que j’ai découvert lors de ce projet est les dépendances entre les équipes. En effet, lors de mes projets étudiants, notre équipe réalisait toujours l’entièreté de l’application et il n’était donc nécessaire de communiquer qu’entre les membres de notre équipe. Le projet <strong>France Travail</strong> étant très large, je n’interviens que sur une partie spécifique et il est donc nécessaire pour moi de communiquer avec différentes équipes dont je peux dépendre. Par exemple, la tâche dont je parle plus haut illustre parfaitement cela. Le développement de l’écran en lui-même ne concerne que mon équipe mais afin de le relier à l’arborescence générale de l’application, j’ai dû travailler en collaboration avec celle chargée de cette partie afin de lui fournir les différentes informations dont elle avait besoin. En parallèle, une autre équipe s’occupe des intégrations des écrans dans d’autres applications et j’ai dû aussi travailler avec elle pour assurer la compatibilité des environnements.<br><br><em>Ecran final une fois que je l'ai livré en production</em><div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Maintenance%20applicative/ecran.png' alt='client' style=' max-width: 90%; height: auto ' /></div>\n\nEn plus de mes activités sur l’application de gestion des demandeurs d’emploi, j’interviens aussi sur la maintenance du référentiel des courriers envoyés par <strong>France Travail</strong>. En effet, j’utilise un langage propriétaire qui permet de gérer toute la partie algorithmique qui vient alimenter le courrier afin d’adapter le contenu à chaque demandeur d’emploi en récupérant les données adaptées et en les traitant en conséquence. Il s’agit ensuite de réaliser les différents tests unitaires nécessaires pour s’assurer que l’évolution est prête pour livraison.\n\nFinalement, j’interviens aussi sur la gestion des données côté <strong>COBOL</strong>. Le projet ayant commencé il y a très longtemps, il utilise des technologies assez anciennes et notamment ce langage pour gérer une partie des données qui sont restituées sur les courriers et sur l’application <strong>Aude</strong>. COBOL est un langage de programmation spécialement conçu pour les applications commerciales et les systèmes d’entreprise et a été développé en 1950. Malgré son âge, il est encore très utilisé en raison de sa fiabilité, de sa robustesse et de sa compatibilité. J’ai donc appris à utiliser <strong>Pacbase</strong>, un outil de développement de logiciels largement utilisé pour le COBOL qui me permet, suivant les demandes du client, de modifier les messages <strong>COBOL</strong> qu’il faut voir comme des compartiments contenant les données associées à des domaines spécifiques.<br><br><em>Exemple de message COBOL dans lequel je viens insérer de nouvelles données</em><div style='margin:10px;display:flex;justify-content:center;align-items:center'><img src='images/projects/Maintenance%20applicative/message.png' alt='client' style=' max-width: 90%; height: auto ' /></div>\n\n<em>Ci-dessous une image de l'application <strong>Aude</strong> et de Pacbase</em>",
                    "acteurs": "De nombreux acteurs sont impliqués dans ce projet de maintenance applicative. Dans un premier temps, le client <strong>France Travail</strong> qui fournit le besoin. Capgemini, le prestataire de services numérique qui prend en charge ce besoin et finalement les différentes équipes qui s’occupent de le traiter en le donnant aux différents développeurs et analystes qui les constituent.",
                    "resultats": "Il est compliqué de parler de résultats définitifs  concernant ce projet étant donné qu’il est toujours en cours et à vocation à continuer. Cependant, le client est très satisfait du travail de notre équipe et n’a pas mentionné la possibilité de mettre fin au contrat ou de changer de prestataire lors du prochain appel d’offre. <strong>France Travail</strong> souhaite même confier plus de missions à l’équipe et il est donc fort probable que le projet s’étende à l’avenir pour couvrir plus de domaines. Ce projet est sans doute celui qui m’a le plus appris. En effet, il m’a permis de découvrir le monde professionnel et tous ses aspects que je ne connaissais pas, notamment ceux de la communication entre les membres de l’équipe, avec les autres équipes ou encore avec le client, tous bien plus poussés que ce que j’avais pu voir lors de mon parcours scolaire.",
                    "lendemain": "",
                    "critique": "Je retiens beaucoup d’enseignements de cette expérience. Lorsque je suis arrivé sur le projet, j’ai pu constater qu’il était très difficile de s’approprier toutes les spécificités de celui-ci. En effet, je possédais déjà des bases grâce à mon cursus scolaire tant au niveau technique que dans la gestion de projet et la communication mais elles ne suffisaient pas une fois appliquées à un projet d’une telle envergure. Il a donc été nécessaire pour moi de pousser bien plus loin mes connaissances notamment grâce à l’aide de collègues plus expérimentés qui m’ont permis de monter en compétence petit à petit en me confiant des tâches à la complexité croissante. Je suis aujourd’hui fier de mon apport sur le projet et je suis capable de gérer des tâches complexes. Depuis quelque temps, j’ai acquis assez d’expérience pour former de nouveaux arrivants et les guider moi-même pour leur montée en compétence. Ces défis étaient difficiles mais surtout galvanisants et m’ont permis de me dépasser et de grandement progresser. Je suis très satisfait des progrès que j'ai fait jusqu’ici mais le projet étant extrêmement vaste, il me reste encore beaucoup à découvrir."
                }
            ],
            "links": [
                {
                    "text": "Voir en détail",
                    "href": "/ProjectDetails"
                }
            ],
            "tags": [
                "Java",
                "Javascript",
                "Architecture web",
                "Git",
                "Agilité"
            ]
        }
    ]
}