{
    "skills": [{
     
            "title": "Techniques",
            "items" : [
     
                {
                    "icon": "images/skills/java.png",
                    "title": "Java",
                    "niveau": "expert",
                    "projects": [
                        "Devmato",
                        "Hypotech",
                        "alternance - Stage"
                      ],
                      "details": [{
                        "definition": "TEST",
                        "preuves": "",
                        "critique": "",
                        "evolution": ""
                }]
                },
                {
                    "icon": "images/skills/mysql.png",
                    "title": "SQL",
                    "niveau": "expert",
                    "projects": [
                        "Devmato",
                        "Hypotech"
                      ],
                      "details": [{
                        "definition": "TEST",
                        "preuves": "",
                        "critique": "",
                        "evolution": ""
                }]
                    
                },
                {
                    "icon": "images/skills/js.png",
                    "title": "Javascript",
                    "niveau": "expert",
                    "projects": [
                        "Devmato",
                        "alternance - Stage"
                      ],
                      "details": [{
                        "definition": "TEST",
                        "preuves": "",
                        "critique": "",
                        "evolution": ""
                }]
                },
                {
                    "icon": "images/skills/git.png",
                    "title": "Git",
                    "niveau": "expert",
                    "projects": [
                        "Devmato",
                        "Hypotech",
                        "alternance - Stage"
                      ],
                      "details": [{
                        "definition": "TEST",
                        "preuves": "",
                        "critique": "",
                        "evolution": ""
                }]
                },
                {
                    "icon": "images/skills/archiweb.png",
                    "title": "Architecture Web",
                    "niveau": "expert",
                    "projects": [
                        "Devmato",
                        "alternance - Stage"
                      ],
                      "details": [{
                        "definition": "TEST",
                        "preuves": "",
                        "critique": "",
                        "evolution": ""
                }]
                }
        ]},
        {
            "title": "humaines",
            "items" : [
                {
                    "icon": "images/skills/montage.png",
                    "title": "Montage",
                    "niveau": "expert",
                    "projects": [
                        "Mat'moi ça",
                        "Agri'Dax"
                      ],
                      "details": [{
                        "definition": "TEST",
                        "preuves": "",
                        "critique": "",
                        "evolution": ""
                }]
                },
                {
                    "icon": "images/skills/gestionprojet.png",
                    "title": "Gestion de projet",
                    "niveau": "expert",
                    "projects": [
                        "Devmato",
                        "Hypotech",
                        "alternance - Stage",
                        "Agri'Dax"
                      ],
                      "details": [{
                        "definition": "La gestion de projet est l'ensemble des activités visant à planifier, organiser, exécuter et contrôler les différentes étapes d'un projet, depuis sa conception jusqu'à sa livraison finale, dans le but d'atteindre des objectifs spécifiques en termes de qualité, de coûts et de délais. C’est une compétence qui s’applique à tout type de projet, qu’il soit informatique ou d’autres domaines.\n\nCette compétence implique également la coordination des différentes parties prenantes impliquées dans le projet, la gestion des risques et des problèmes, la communication efficace et la gestion des ressources humaines, matérielles et financières.\n\nLa vie professionnelle au quotidien implique d’enchaîner les projets. Ces projets peuvent être de tout type allant de la réalisation d’une action formation à la création d’une application mobile par exemple. Quel que soit le projet et son périmètre, une bonne méthode de gestion permettra de le réaliser efficacement.",
                        "preuves": "J’ai été à plusieurs reprises confronté à la gestion de projet au cours de mon cursus à INTECH. Durant un semestre, avec 3 autres camarades, nous étions chargés de réaliser une action de formation (lier la réal). J’ai eu lors de ce projet à endosser le rôle très important de chef de projet. Une première expérience pour moi de la gestion de cette responsabilité et des différents challenges à gérer que cela apporte. Ce projet visait à aider une association à former ses membres à l’utilisation d’un nouveau logiciel pour faciliter leur travail.\n\nIl n’était pas simple dans les premières semaines de bien déterminer la méthode efficace pour répartir les rôles avec pertinence tout en maintenant une communication de qualité avec les différentes parties prenantes du projet. J’ai dû apprendre au fur et à mesure de mes erreurs comment communiquer au mieux avec mon équipe.\n\nJ’ai notamment fait face à un contexte exceptionnel durant ce projet, il se déroulait en pleine période de confinement, le premier projet que nous avions à réaliser en étant coupé de tout contact physique avec les autres membres de l’équipe. C’est donc en demandant conseils autour de moi et en adaptant au mieux mes connaissances de la méthode de travail que j’ai finalement réussi avec mes camarades, à réaliser une action de formation de qualité très appréciée par l’entreprise l’ayant demandée, malgré un contexte très particulier.\n\nCe premier projet réalisé en tant que chef de projet a été une occasion formidable de développer mes connaissances à ce sujet et d’apprendre comment faire encore mieux pour les projets qui suivront. J’ai notamment eu l’occasion de le réaliser peu de temps après avec le projet que nous avons réalisé en semestre 5 : Hypotech (lier la réal).\n\nCe projet se passait dans un cadre plutôt différent, la réalisation d’une application mobile et m’a donc confronté à de nouvelles problématiques de gestion de projet. Les connaissances que j’avais acquises jusqu’ici m’ont permis d’être efficace sur la communication entre les membres de mon équipe et les parties prenantes.\n\nAprès avoir bien avancé sur le projet et arrivant vers la fin du semestre, j’ai dû faire face à une problématique que je n’avais encore jamais rencontré ou envisagé : le commanditaire lors d’une de nos réunions habituelles pour parler de l’avancement du projet, a décidé de totalement changer d’idée sur ce qu’il voulait et cela a été une grosse source de panique dans notre équipe.\nDans un premier temps, j’ai fait l’erreur de trop vouloir accepter ces changements alors qu’il était clair que le temps allait nous manquer. Heureusement, après discussion entre les membres de l’équipe et les conseils des encadrants, j’ai appris à être plus ferme avec notre commanditaire en lui expliquant clairement et honnêtement la situation, ce qu’il a bien compris et nous avons pu terminer sans cette pression supplémentaire.",
                        "critique": "Ces différentes expériences m’ont permis de beaucoup progresser dans la maîtrise de cette compétence dans laquelle j’étais encore très débutant avant mon cursus à INTECH.\n\nJ’ai notamment appris au travers de la réalisation de ces différents projets la gestion des différentes ressources humaines, la communication entre toutes les parties prenantes ou encore la gestion des ressources techniques. C’est aussi en réalisant deux projets très différents que je me suis rendu compte de tous les aspects spécifiques auxquels il faut s’adapter pour gérer un projet. Il est donc clair que j’ai beaucoup progressé mais que je peux toujours m’améliorer et perfectionner les méthodes.\n\nAinsi, avec le recul de ces années, je me rends compte du caractère indispensable qu’occupe la gestion de projet pour tout ingénieur. Moi qui étais personnellement très peu enjouée à l’idée d’être chef de projet, je le conseillerai aujourd’hui à n’importe qui et de ne pas hésiter, c’est pour moi le meilleur moyen de gagner en expérience. Les projets que nous avons réalisés durant notre cursus étant dans un cadre scolaire, ils sont une excellente opportunité pour essayer des choses et se tromper pour se préparer au mieux à la vie dans le monde professionnel.",
                        "evolution": "Dans mon projet professionnel, c’est une compétence que je souhaite développer. J’ai acquis beaucoup de connaissances au cours de mon cursus et dans mes débuts en entreprise mais je pense qu’il faut encore que j’explore différentes méthodes et formations qui me permettraient d’être très efficace et d’appliquer ces connaissances à des projets en entreprise à plus grande échelle."
                }]
                },
                {
                    "icon": "images/skills/agile.png",
                    "title": "Agilité",
                    "niveau": "expert",
                    "projects": [
                        "Devmato",
                        "Hypotech",
                        "alternance - Stage"
                      ],
                      "details": [{
                        "definition": "TEST",
                        "preuves": "",
                        "critique": ""
                }]
                },
                {
                    "icon": "images/skills/communication.png",
                    "title": "Communication",
                    "niveau": "expert",
                    "projects": [
                        "Mat'moi ça",
                        "Agri'Dax",
                        "Hypotech"
                      ],
                      "details": [{
                        "definition": "TEST",
                        "preuves": "",
                        "critique": "",
                        "evolution": ""
                }]
                },
                {
                    "icon": "images/skills/evenementiel.png",
                    "title": "Evenementiel",
                    "niveau": "expert",
                    "projects": [
                        "Mat'moi ça",
                        "Agri'Dax"
                      ],
                      "details": [{
                        "definition": "TEST",
                        "preuves": "",
                        "critique": "",
                        "evolution": ""
                }]
                }
            ]
        }
]}