{
    "about": "Présentation générale\n\nA propos\n\nAprès l’obtention d’un baccalauréat Scientifique option Sciences de l’ingénieur, j’ai pris la décision de poursuivre mes études à l’école supérieur d’informatique INTECH sud et plus précisément dans sa spécialité Ingénierie du logiciel. La finalité de ce cursus me permettra d’obtenir un diplôme d’Expert en Ingénierie du Logiciel.\nC’est dans le cadre de ce cursus que je suis actuellement en alternance depuis plus d’un an dans l’entreprise Capgemini en tant que développeur.\nDans ma démarche professionnelle, trois valeurs me guident au quotidien : l’innovation, l’adaptabilité et la curiosité. En effet, il est très important à mes yeux d’être constamment à la recherche de nouvelles idées et de solutions créatives pour aborder les défis technologiques d’aujourd’hui et de demain. Ce désir d’innover m’incite à m’éloigner de ma zone de confort afin d’explorer de nouvelles technologies et à envisager des approches inédites pour résoudre des problèmes complexes. De plus, dans ce monde de l’informatique en constante évolution, cette démarche me pousse à m’ajuster à de nouvelles tendances, méthodes de travail et outils. Enfin, c’est la curiosité qui m’encourage à toujours creuser plus profondément les sujets qui me passionnent pour pouvoir en comprendre les moindres détails.\nOutre les valeurs qui m’importent beaucoup au quotidien, il est à mes yeux très important de ne jamais oublier que l’on travaille au sein d’une équipe. Dans cette optique, il est  aussi très important pour moi de développer mes qualités humaines. Je pense que l'empathie, la collaboration et la persévérance sont des qualités qui me caractérisent. Je crois fermement que le succès dans le développement informatique dépend en grande partie de la capacité à travailler en équipe et à comprendre les besoins des utilisateurs.\n\nProjets pro / perso\n\nMon projet professionnel est avant tout basé sur l’apprentissage continu. Je suis déterminé à acquérir de nouvelles compétences et à me perfectionner. L’expérience acquise en entreprise durant mon stage et mon alternance m’ont permis de réaliser que je ne souhaitais pas m’enfermer dans une technologie spécifique mais plutôt découvrir de nouveaux projets innovants me challengeant dans mes habitudes.\nD’un point de vue plus personnel, étant très attaché à l’innovation, j’effectue beaucoup de veille technologique.\nJ’apprécie aussi la lecture, la pratique d’activités sportives comme l’escalade poussant à se dépasser mais aussi jouer à des jeux-vidéos mettant en pratique réflexes, réflexion et collaboration.\n",
    "imageSource": "reactPortfolio/images/about/profile.png"
    
}