{
    "experiences": [
        {
            "title": "Développeur",
            "subtitle": "Capgemini",
            "workType": "Alternant",
            "workDescription": [
          
            ],
            "details" : "Lors de mon alternance chez Capgemini, j’ai eu comme rôle celui de développeur. Ma mission était d’effectuer la maintenance applicative de l’application utilisée par les conseillers de France Travail pour gérer les demandeurs d’emploi.<br /> <br />Capgemini, en tant que leader mondial dans le domaine des services numériques et du conseil, a pour vision d'accompagner ses clients dans leur transformation digitale en proposant des solutions innovantes et adaptées à leurs besoins. Dans le cadre de ma mission, j'ai pu contribuer à cette vision en assurant le bon fonctionnement et l'amélioration continue de l'application utilisée par France Travail. En travaillant sur la maintenance applicative, j'ai aidé à garantir la stabilité et la fiabilité de l'application, tout en identifiant et en mettant en œuvre des améliorations pour répondre aux besoins évolutifs des utilisateurs.",
            "dateText": "09/2022 – Présent",
            "logo" : "images/experiences/Capge_Logo.png",
            "href" : "https://www.capgemini.com/fr-fr/"
        },
        {
            "title": "Développeur",
            "subtitle": "Capgemini Mérignac",
            "workType": "Stagiaire",
            "workDescription": [
                
            ],
            "details" : "Durant mon stage chez Capgemini, j’ai eu la même mission que lors de mon alternance. Pour moi, la différence majeure était que c'était principalement une période de montée en compétence et de découverte de l’entreprise et du projet. J’ai au fur et à mesure appris à connaître Capgemini et à prendre de plus en plus de responsabilités au sein du projet, responsabilités qui ont continué à se développer lors de mon alternance.",
            "dateText": "03/2022 – 09/2022",
            "logo" : "images/experiences/Capge_Logo.png",
            "href" : "https://www.capgemini.com/fr-fr/"
        },
        {
            "title": "Etudiant",
            "subtitle": "INTECH Dax",
            "workType": "Elève",
            "workDescription": [
                "Expert en Ingénierie du Logiciel"
            ],
            "details" : "INTECH est un établissement d'enseignement supérieur spécialisé dans les domaines de l'informatique, des technologies numériques et de l'ingénierie. Fondée sur des valeurs d'innovation et d'excellence, INTECH offre une formation de qualité alliant théorie et pratique.<br /><br />Avec une gamme de programmes allant du bachelor au master, INTECH prépare ses étudiants à relever les défis du monde professionnel grâce à des cours dispensés par des experts, des projets concrets et des stages en entreprise. L'école dispose d'une infrastructure moderne et favorise l'entreprenariat et l'innovation.<br /><br />Grâce à ses liens étroits avec l'industrie, INTECH offre d'excellentes opportunités professionnelles à ses diplômés, les accompagnant dans leur recherche de stages et d'emplois.",
            "dateText": "09/2019 – 2024",
            "logo" : "images/experiences/INTECH_Logo.PNG",
            "href" : "https://www.esiea.fr/"
        },
        {
            "title": "Etudiant",
            "subtitle": "Lycée Gaston Crampe, Aire sur l'adour",
            "workType": "Elève",
            "workDescription": [
                "Baccalauréat Scientifique spécialité Sciences de l'Ingénieur"
            ],
            "details" : "Le lycée Gaston Crampe, situé à Aire-sur-l'Adour, est une institution d'enseignement secondaire réputée dans la région. Le lycée offre un environnement propice à l'apprentissage et à l'épanouissement des élèves.<br /><br />L’établissement propose un large éventail de filières et de programmes éducatifs pour répondre aux besoins et aux intérêts divers des étudiants. Que ce soit dans les filières générales, technologiques ou professionnelles, les élèves bénéficient d'une éducation de qualité dispensée par des enseignants compétents et dévoués.<br /><br />Au-delà des cours académiques, le lycée Gaston Crampe encourage également la participation des élèves à des activités extrascolaires telles que des clubs, des événements culturels et des compétitions sportives. Grâce à ses installations modernes et ses ressources pédagogiques de pointe, le lycée offre un cadre optimal pour l'apprentissage, la recherche et le développement personnel des élèves. ",
            "dateText": "09/2016 – 07/2019",
            "logo" : "images/experiences/cite_gc.png",
            "href" : "https://www.aire-sur-adour.fr/les-services/colleges-lycees/cite-scolaire-gaston-crampe/"
        }
    ]
}