{
    "projects" : [
        {
            "image" : "images/projects/echecs.png",
            "title": "Mat'moi ça",
            "bodyText": "Organisation d’un tournoi d’échec en ligne afin de reverser l’argent récolté à l’association UNICEF",
            "details": [{
                    "presentation": "<strong>Mat ‘moi ça</strong> est un tournoi d’échecs caritatif organisé par notre groupe de semestre 4 lors de notre cursus à <strong>INTECH</strong> dans l’objectif de reverser les fonds récoltés à l’<a href='https://www.unicef.fr/'>UNICEF</a>. Notre choix s’est porté sur les échecs car c’est un jeu traversant les époques et qui revenait à la mode au moment de sa réalisation, c’est-à-dire lors du premier confinement. Cet engouement a aussi été nettement appuyé par la série « Le jeu de la dame » qui a suscité un grand intérêt de la population pour ce jeu. C’était pour moi particulièrement excitant d’organiser un tournoi sur ce jeu car je l’avais découvert il y a peu et un grand désir d’en découvrir toutes les facettes m’habitait.\n\nLe Fonds des Nations Unies pour l'enfance est une organisation internationale dédiée à <strong>la protection et au bien-être des enfants du monde entier</strong>. Créé en 1946, l'<a href='https://www.unicef.fr/'>UNICEF</a> travaille sans relâche pour garantir les droits fondamentaux de chaque enfant, notamment le droit à la santé, à l'éducation, à la protection et à la participation. Cette organisation, active dans plus de 190 pays, mène des projets essentiels pour lutter contre la malnutrition, améliorer l'accès à l'eau potable, fournir une éducation de qualité, et bien plus encore. Ces engagements m’avaient particulièrement touchés et c’est pour cela que j’étais particulièrement enthousiaste à l’idée de récolter des fonds pour cette association.",
                    "objectifs": "Les objectifs dans l’organisation de ce projet étaient multiples. Il nous fallait trouver des partenaires pour pouvoir financer le projet et récompenses du tournoi mais aussi trouver des personnalités pouvant faire la promotion du tournoi afin d’attirer plus de joueurs. De plus, il fallait établir une communication sur les réseaux sociaux autour de l’évènement. Finalement, la définition des règles du tournoi en lui-même était aussi un aspect important.\n\nLa principale difficulté que nous avons rencontré durant la réalisation de ce projet est de faire face à notre manque d’expertise et de crédibilité dans le monde des échecs. En effet, il est difficile pour un groupe d’étudiants inconnu de cet univers de trouver des sponsors ou de gagner en visibilité.",
                    "etapes": "Il a donc été très important de bien définir les étapes de réalisation du projet. Nous avons débuté notre projet par l'élaboration des règles du tournoi et le choix de la plateforme de jeu en ligne. Cette phase initiale a posé les bases de notre événement caritatif, garantissant son équité et sa compatibilité avec nos objectifs. Il semblait important à mes yeux de trouver une plateforme qui pourrait à la fois nous donner un maximum de visibilité tout en restant en accord avec nos valeurs et celles que défendent l’<a href='https://www.unicef.fr/'>UNICEF</a>.\n\nSimultanément, nous avons contacté des influenceurs du monde des échecs, cherchant leur soutien pour notre initiative. Leur implication était cruciale pour élargir la portée de notre tournoi. Ainsi, durant toute la phase de préparation, j’ai aussi eu l’occasion de contacter de nombreux influenceurs du monde des échecs par le plus de médias possibles : par mail, twitter, Facebook, téléphone voire même en allant directement parler dans le chat de certains steamers pour se faire remarquer. C’était un challenge particulièrement compliqué au vu du manque de crédibilité évident qu’un étudiant peut avoir. Il m’a fallu adapter mon discours à chacun pour faire ressortir notre projet et partager notre envie d’aider afin de convaincre un maximum d’influenceurs. Ces actions ont connu beaucoup de succès, parmi lesquels on peut retrouver <a href='https://twitter.com/ffechecs'>La Fédération Française des Echecs</a>, <a href='https://twitter.com/Dicomaniaque'>Dicomaniaque</a> ou encore <a href='https://twitter.com/Lampi0n_'>Lampion</a>.\n\nUne fois ces bases établies, nous avons animé le tournoi en le diffusant en direct sur <a href='https://www.twitch.tv/'>Twitch</a>. Cette diffusion en direct a permis d'engager le public, de susciter son intérêt, et de l'inciter à faire des dons en temps réel. Une fois de plus, c’était un exercice très intéressant de galvaniser un public et surtout de l’inciter à donner pour la bonne cause tout en rendant le tournoi intéressant à regarder. Personnellement, je l’ai pris comme un challenge. Étant de nature réservée, l’occasion était parfaite pour me dépasser et sortir de ma zone de confort.\n\nTout au long de ce processus, la communication sur les réseaux sociaux a joué un rôle essentiel. Elle nous a permis de maintenir l'intérêt du public, de partager des mises à jour sur le tournoi et d'encourager la participation. Cette <strong>communication</strong> était un travail de fond très important durant le projet. Elle a permis d’une part de tenir la communauté créée informée des actualités du tournoi mais aussi d’attirer de nouveaux joueurs et donateurs potentiels. Ce n’était pas un exercice facile et il a été nécessaire de redoubler de créativité pour créer des posts engageants et des visuels attrayants.\n\nCe cheminement logique nous a conduit à la réussite de notre projet, en alliant stratégie, promotion, interaction en direct, et <strong>communication</strong> efficace pour soutenir une cause charitable.",
                    "acteurs": "Beaucoup d’<strong>acteurs</strong> ont été impliqués dans la réalisation de ce projet. Dans un premier temps, <a href='https://www.chess.com/'>chess.com</a>, la plus grande plateforme d’échecs en ligne que nous avons réussi à contacter et qui nous a aidé dans l’organisation, notamment en nous fournissant des comptes premium à offrir aux participants du tournoi.\n\nDans un second temps, plusieurs influenceurs que nous avons contactés ont accepté de mettre en avant notre événement auprès de leur communauté voire de diffuser le tournoi afin d’augmenter le plus possible sa visibilité.\n\nFinalement, l’<a href='https://www.unicef.fr/'>UNICEF</a> a aussi été un grand soutien. Lorsque nous les avons contactés pour leur parler de notre projet, ils se sont tout de suite montrés très enthousiastes et nous ont mis en avant sur leur réseaux sociaux et été publiés dans le sud-ouest sur un petit article.",
                    "resultats": "L’association a été très satisfaite de notre travail et de notre implication dans l’organisation de ce tournoi mais aussi satisfaite des résultats et des retours positifs des participants. Quant à moi, j’ai eu l’occasion de découvrir le monde des échecs que je connaissais très peu à l’époque et de découvrir que j’aimais beaucoup cet univers. J’ai aussi été très heureux de constater la satisfaction de l’association et de l’aide que nous avons pu leur apporter. Tous les efforts réunis dans l’organisation du tournoi ont permis de rassembler des dizaines de joueurs mais surtout des centaines d’euros de donation dont l’association a pu faire bon usage.",
                    "lendemain": "",
                    "critique": "Ce projet s’est très bien déroulé et nous avons tous su au sein de l’équipe endosser les différents rôles avec facilité et avons su nous entraider avec efficacité. Je suis très fier d’avoir pu aider l’<a href='https://www.unicef.fr/'>UNICEF</a> dans leurs actions et d’avoir pu mener ce projet à son terme malgré les difficultés rencontrées.\n\nMon plus grand regret lors de la réalisation de ce projet est de ne pas avoir pu le réaliser en présentiel avec tous les joueurs réunis dans la même salle. Au vu des conditions sanitaires de l’époque, il ne nous était pas possible de réunir autant de personnes sans risquer de créer un cluster. Si c’était à refaire, je donnerai mon maximum pour que tout se passe en présentiel."
            }],
            "links": [
                {
                    "text": "Voir en détail",
                    "href": "/ProjectDetails?title=Mat'moi ça"
                }
                
            ],
            "tags" : [
                "Gestion de projet",
                "Evenementiel",
                "Montage"
            ]
        },
        {
            "image" : "images/projects/devmato.png",
            "title": "Devmato",
            "bodyText": "Site web pour le dermofacialisme. Le site vise à faire connaître ce métier et à mettre en relation les clients",
            "details": "test",
            "links": [
                {
                    "text": "Voir en détail",
                    "href": "/ProjectDetails"
                }
            ],
            "tags" : [
                "Java",
                "SQL",
                "Git",
                "Javascript",
                "Architecture Web",
                "Gestion projet",
                "Agilité"
            ]
        },
        {
            "image" : "images/projects/hypotech.PNG",
            "title": "Hypotech",
            "bodyText": "Application Android simplifiant le travail administratif des agents immobiliers",
            "details": "test",
            "links": [
                {
                    "text": "Voir en détail",
                    "href": "/ProjectDetails?title=Hypotech"
                }
            ],
            "tags" : [
                "Java",
                "SQL",
                "Git",
                "Agilité"
            ]
        },
        {
            "image" : "images/projects/AgriDax.PNG",
            "title": "Agri'Dax",
            "details": "test",
            "bodyText": "Former les membres de l'assocation AMAP à l'utilisation d'un logiciel facilitant leur travail",
            "links": [
                {
                    "text": "Voir en détail",
                    "href": "/ProjectDetails?title=Agri'Dax"
                }
            ],
            "tags" : [
                "Gestion de projet",
                "Evenementiel",
                "Communication",
                "Montage"
            ]
        },
        {
            "image" : "images/projects/capge.png",
            "title": "alternance - Stage",
            "bodyText": "Maintenance applicative en tant que développeur chez Capgemini",
            "details": "test",
            "links": [
                {
                    "text": "Voir en détail",
                    "href": "/ProjectDetails"
                }
            ],
            "tags" : [
                "Java",
                "Javascript",
                "Architecture Web",
                "Cobol",
                "XML",
                "Agilité"
            ]
        }
       
    ]
}