{
    "skills": [{
     
            "title": "Techniques",
            "items" : [
     
                {
                    "icon": "images/skills/java.png",
                    "title": "Java",
                    "niveau": "EXPERT",
                    "projects": [
                        "Devmato",
                        "Hypotech",
                        "Maintenance applicative"
                      ],
                      "details": [{
                        "definition": "<strong>Java</strong> est un langage de programmation polyvalent et orienté objet largement utilisé dans le développement logiciel professionnel. Créé par Sun Microsystems (acquis par Oracle Corporation en 2010), <strong>Java</strong> offre une plateforme puissante et portable pour le développement d'applications, de sites web dynamiques, de logiciels d'entreprise et de solutions embarquées.\n\nLa maîtrise de <strong>Java</strong> implique la capacité à concevoir, développer, déboguer et maintenir des applications logicielles robustes et évolutives. Il est important d’avoir une solide compréhension des concepts fondamentaux de la programmation orientée objet, ainsi que des compétences avancées dans des domaines tels que la gestion de la mémoire, la manipulation des exceptions, la concurrence, et l'accès aux bases de données.\n\nDepuis son introduction par Sun Microsystems en 1995, <strong>Java</strong> a évolué pour s'adapter aux tendances et aux exigences changeantes de l'industrie informatique. Sa popularité persistante est attestée par son utilisation généralisée dans des domaines aussi divers que le développement Android, le Big Data, l'IoT (Internet des Objets), les services web et bien d'autres.\n\nDans le contexte actuel, marqué par une demande croissante de solutions logicielles performantes et évolutives, <strong>Java</strong> continue de jouer un rôle central dans le paysage technologique contemporain. Sa polyvalence et sa portabilité en font un choix privilégié pour une multitude d'applications, allant des applications mobiles aux systèmes embarqués en passant par les infrastructures d'entreprise.",
                        "preuves": "C’est au cours de mon cursus à INTECH que j’ai eu l’occasion de me confronter pour la première fois au <strong>Java</strong>. Durant le semestre 4, j’ai eu l’occasion de réaliser une <a href='https://fr.wikipedia.org/wiki/Interface_de_programmation'>API</a> en <strong>Java</strong> lors de la réalisation du projet <a href='/reactPortfolio/#/ProjectDetails/Devmato'>Devmato</a>. Le projet avait pour objectif de réaliser une plateforme pour mettre en contact les patients et les professionnels du dermofacialisme. Nous avions décidé de réaliser toute la partie back-end de notre application en <strong>Java</strong>.\n\nJ’ai notamment eu une difficulté majeure lors de ce projet : l'intégration de widgets tel que calendly pour pouvoir gérer les rendez-vous des utilisateurs sans avoir à recréer entièrement une application de calendrier. C’était à la fois un gain de temps mais aussi plus pratique pour les utilisateurs d’utiliser une application qu’ils connaissaient déjà. L’intégration n'était pas facile et j’ai notamment rencontré de nombreuses difficultés à la maintenir car l’application évoluait constamment et me forçait à revenir régulièrement sur le code pour l’adapter. J’ai beaucoup appris lors de ce projet afin d’adapter mon code pour limiter le plus possible des interventions trop régulières. \n\nDans le cadre de mon alternance, j’ai eu l’occasion de me confronter à la technologie <strong>Java</strong> appliquée à un projet d’envergure. En effet, ma mission lors de mon alternance chez Capgemini était d’effectuer la <a href='/reactPortfolio/#/ProjectDetails/Maintenance%20applicative'>maintenance applicative</a> d’un logiciel utilisé par les conseillers de France Travail. C’était pour moi un challenge tout nouveau, le projet ayant 20 ans d’historique, il a été très compliqué de me familiariser avec l’existant. Il fallait aussi que je compose avec une version et un environnement de travail assez ancien (<strong>Java</strong> 6) qui m’a éloigné de tous les repères que j’avais connus jusque là. \n\nC’est à force de travail et de formations que j’ai finalement réussi à prendre en main cet environnement et à mettre en place de nouveaux écrans apportant de nouvelles fonctionnalités mais aussi de résoudre les différentes anomalies remontées. J’ai aussi eu l’occasion de comprendre la communication qui s’effectue entre le COBOL et le <strong>Java</strong>, les données étant gérées en COBOL que l’on vient ensuite récupérer côté <strong>Java</strong>.",
                        "critique": "Au fil de mes expériences dans les différents projets, j'ai développé une solide expertise dans l'utilisation du langage Java et je me considère aujourd'hui comme étant à un niveau confirmé. Je pense être compétent pour réaliser ou maintenir un projet utilisant cette technologie. C’est notamment grâce aux différentes expériences et projets auxquels j’ai participé que mon apprentissage de la technologie a pu être fluide.\n\nAvec le niveau que j’ai atteint aujourd’hui sur le langage, je conseillerai à tout développeur de s’intéresser au Java mais non en tant que débutant. En effet, Java offre beaucoup de possibilités et est très répandu mais il peut être assez complexe pour une personne inexpérimentée de commencer par une technologie aussi complexe. Je conseillerai donc à un développeur débutant de s’orienter vers des langages plus simples dans un premier temps comme Javascript par exemple.",
                        "evolution": "Le <strong>Java</strong> est aujourd’hui une technologie très utilisée dans le domaine du développement dans de très nombreuses entreprises et c’est pour cela que c’est une compétence qui occupe une place très importante dans mon projet professionnel. J'ai beaucoup appris sur le langage au fil de mes expériences mais je pense pouvoir encore beaucoup progresser. Ainsi, je considère le développement de mes compétences Java comme une priorité à moyen et long terme car les projets sur lesquels je vais être amené à travailler utilisent cette technologie. Dans cette optique, je prévois de suivre les différentes formations offertes par <strong>Capgemini</strong>, qui me donnent une opportunité unique d'approfondir mes connaissances. Je prévois aussi d’associer à ces formations des projets personnels me permettant de découvrir et comprendre le fonctionnement de frameworks tels que <strong>Spring</strong> ou <strong>Hibernate</strong>, très largement utilisés dans le domaine."
                }]
                },
                {
                    "icon": "images/skills/mysql.png",
                    "title": "SQL",
                    "niveau": "PRO",
                    "projects": [
                        "Devmato",
                        "Hypotech"
                      ],
                      "details": [{
                        "definition": "Le langage <strong>SQL</strong> (Structured Query Language) a été créé en 1974 par Donald D. Chamberlin et Raymond F. Boyce. <strong>SQL</strong> est un langage de programmation standardisé utilisé pour interagir avec des bases de données relationnelles. Sa principale fonction est de permettre aux utilisateurs d’interroger, de manipuler et de gérer les données stockées dans une base de données.\n\nAvec la prolifération des données massives et des technologies basées sur les données, la capacité à manipuler efficacement les informations est devenue cruciale. Le <strong>SQL</strong> joue donc un rôle central dans cette ère de l’information. Dans le monde d’aujourd’hui où les entreprises collectent et analysent des quantités massives de données provenant de diverses sources, la maîtrise du <strong>SQL</strong> permet de naviguer et d’exploiter ces données pour en extraire des informations précieuses. Que ce soit pour comprendre les tendances du marché, personnaliser les expériences client ou prendre des décisions stratégiques basées sur les données, le <strong>SQL</strong> est l’outil fondamental qui alimente ces processus.\n\nDe plus, l’émergence de l’intelligence artificielle et de l'apprentissage automatique, où l’analyse de données joue un rôle crucial, la compréhension du <strong>SQL</strong> devient encore plus importante. Les algorithmes d’apprentissage nécessitent souvent des ensembles de données bien structurés et la manipulation de ces données commence par des requêtes sophistiquées pour les préparer à l’analyse.",
                        "preuves": "Le premier projet sur lequel j’ai pu découvrir et mettre en pratique le <strong>SQL</strong> s’est présenté durant mon cursus à INTECH. En effet, durant le semestre 2, nous avons eu à réaliser un site qui comprenait un système d’authentification afin qu’un utilisateur ou un administrateur du site puisse se connecter et effectuer les actions liées à son rôle. \n\nNous avons donc dû réaliser une base de données pour cette gestion et développer des scripts <strong>SQL</strong> permettant notamment l’ajout de données lors de l’inscription d’un nouveau compte afin que l’utilisateur ait la possibilité de se connecter. Les utilisateurs pouvaient ajouter leur adresse e-mail pour recevoir les actualités et pouvaient à tout moment changer leurs informations, ce qui déclenchait l’éxécution du script <strong>SQL</strong> associé modifiant ces valeurs dans la base données. Les utilisateurs n’ayant pas énormément de possibilités, c’est surtout au niveau des administrateurs que la complexité se présentait. En effet, les administrateurs avaient la possibilité de créer et de supprimer des comptes mais aussi d’ajouter des actualités au site. Il était donc particulièrement intéressant de créer toutes ces intéractions en base de données.\n\nUn projet sur lequel le <strong>SQL</strong> a joué un rôle très important est <a href='/reactPortfolio/#/ProjectDetails/Devmato'>Devmato</a>. En effet, durant le semestre 4 de mon cursus à INTECH, j’ai eu à réaliser un site  avec des relations bien plus complexes que ce que j’avais exploré précédemment. Le but du projet était de créer un site mettant en relation des patients avec des professionnels du dermofacialisme afin qu’ils puissent gérer leurs rendez-vous. C’était un challenge compliqué à relever.\n\nIl a été nécessaire de créer une base de données solide capable d'accueillir les informations des patients ainsi que leurs disponibilités mais aussi celles des professionnels du dermo facialisme tout en créant un évènement en base de données lorsqu'un utilisateur souhaitait prendre rendez-vous. Il fallait aussi prendre en compte la partie gestion du site par des administrateurs. \n\nLa gestion de tous ces différents éléments en base de données n’était pas simple du tout à mettre en place et il a fallu beaucoup de réflexion pour réaliser des scripts <strong>SQL</strong> robustes qui prennaient en compte toutes les différentes intéractions entre les différents utilisateurs de la plateforme.",
                        "critique": "Le SQL a une syntaxe qui rend les requêtes lisibles et compréhensibles, ce qui rend sa prise en main facile. Je me suis aperçu moi-même de cette facilité lors de mes premières intéractions avec le langage. Je pensais à la base le principe d’une base de données compliqué à comprendre, mais cette facilité de prise en main m’a permis d’assimiler rapidement des points qui me semblaient précédemment peu clairs. C’est pour cela que je me sens maintenant assez à l’aise dans l’utilisation du langage et que je conseillerai à tout développeur débutant de se familiariser avec, mais de ne pas oublier que le SQL n’est qu’une partie du projet et donc de garder en tête qu’il est important de se concentrer aussi sur tout ce qui gravite autour.\n\nAu fil de mes expériences dans les différents projets, je pense avoir acquis une bonne expérience dans l’utilisation du SQL. Je pense être compétent pour aider une équipe dans la mise en place d’une base de données et le développement de scripts pour utiliser et maintenir la base. Je me considère donc comme confirmé sur cette compétence.",
                        "evolution": "<strong>SQL</strong> est le langage de requête le plus célèbre et le utilisé dans le monde. Quasiment toute application a besoin d’une base données et le SQL est le langage le plus lisible et efficace afin d’atteindre ce but. Il est donc presque certain que c’est une technologie que je retrouverai dans quasiment tous les projets sur lesquels je vais travailler. C’est pourquoi il sera toujours important dans mon projet professionnel d’être compétent sur cette technologie. Afin de progresser continuellement en SQL, j’effectue beaucoup de veille sur le sujet et je m’appuie sur des documentations en ligne comme <a href='https://sql.sh/'>celle-ci</a>. Finalement, mon apprentissage passe aussi par des livres comme <strong>SQL Performance Explained</strong> par Markus Winand."
                }]
                    
                },
                {
                    "icon": "images/skills/js.png",
                    "title": "Javascript",
                    "niveau": "PRO",
                    "projects": [
                        "Devmato",
                        "Maintenance applicative"
                      ],
                      "details": [{
                        "definition": "Le Javascript est un langage de programmation incontournable dans le développement web. Il a été créé en 1995 par Brendan Eich chez Netscape et est aujourd’hui devenu l’un des langages de programmation les plus utilisés et influents. Il a été initialement développé pour améliorer l’expérience des premiers navigateurs web en permettant des intéractions dynamiques sur les pages web.\n\nLa maîtrise du Javascript est essentielle pour les développeurs web. En effet, ses capacités à gérer les évènements côté client et à communiquer avec les serveurs via des requêtes HTTP en font un outil puissant pour créer des applications web interactives et dynamiques.\n\nAu fil du temps, JavaScript a évolué pour s'adapter aux exigences croissantes du développement web moderne. L'émergence de frameworks comme jQuery, Angular, React et Vue.js a simplifié et accéléré le processus de développement, permettant de créer des applications web complexes avec une efficacité accrue.\n\nAujourd'hui, JavaScript est utilisé non seulement pour le développement front-end, mais aussi pour le développement back-end grâce à des plateformes comme Node.js. Cette polyvalence en fait un choix privilégié pour les entreprises cherchant à créer des applications web complètes et cohérentes.",
                        "preuves": "Ma toute première interaction avec le Javascript a eu lieu en semestre 1 de mon cursus à INTECH. En effet, le projet que j’ai réalisé ce semestre consistait à réaliser un jeu web éducatif à destination d’enfants en école primaire. C’était pour moi une découverte totale et les nombreux concepts à assimiler n’ont dans un premier temps pas été simples à appliquer à un sujet aussi particulier que les jeux-vidéos. Malgré la difficulté à assimiler beaucoup de nouvelles notions en un temps assez limité, j’ai réussi à m’adapter et à finaliser le projet avec un résultat assez surprenant pour le niveau débutant que j’avais.\n\nJ’ai ensuite rencontré le Javascript à plusieurs reprises ce qui m’a permis de progresser petit à petit mais l’expérience qui m’a fait passer à un tout autre niveau est celle de la réalisation de ce portfolio. En effet, lorsque j’ai commencé à travailler dessus, je me suis aperçu que je serai très limité en me contentant de javascript natif ou que cela me compliquerait trop la tâche. C’est pour cela que je me suis tourné vers des frameworks et que j’ai eu ma première interaction avec React. Cette expérience a été très enrichissante car j’ai découvert une manière de développer très différente, bien plus structurée et puissante. Il a dans un premier temps été difficile pour moi de comprendre tous les tenants et aboutissants de l’utilisation de cette nouvelle couche mais une fois assimilée, j’ai réellement compris la puissance de tel framework et leur intérêt.",
                        "critique": "Après les différentes expériences que j’ai eu l’occasion d’avoir autour du Javascript, je pense avoir atteint une maîtrise professionnelle de la technologie. C’est une technologie que j’ai rencontrée à mes débuts de développeur et que j’ai par conséquent mis du temps à maîtriser car je découvrais par la même occasion les concepts les plus basiques de la programmation. Ma progression a ensuite été bien plus rapide au fil de ma maitrise des différents concepts de base.\n\nEn tant que développeur, je pense que la maîtrise au moins basique du Javascript est très importante. C’est une technologie que l’on rencontre partout et qui se révèle extrêmement importante pour tout développeur. C’est pour cela que je conseillerai à n’importe qui dans le domaine de s’y intéresser mais aussi de commencer par là pour des débutants.",
                        "evolution": "Au fil de mes expériences, je me suis rendu compte que le Javascript est une technologie omniprésente dans le domaine du développement web. Je considère aujourd’hui avoir atteint un niveau confirmé sur le langage mais je suis convaincu de l’importance de continuer à me former car c’est une compétence importante dans mon projet professionnel à moyen terme. En effet, les projets sur lesquels je suis amené à travailler comportent tous un aspect web et impliquent donc l’utilisation du Javascript. A cet égard, je suis particulièrement intéressé par l’approfondissement de mes connaissances sur le sujet notamment à travers l’apprentissage de frameworks comme <strong>Angular</strong>. C’est pour cette raison que je me penche sur les différentes formations proposées par <a href='https://www.udemy.com/topic/angular/'>udemy</a>. Afin de développer encore plus mes connaissances sur le sujet, je lis aussi des livres comme <strong>Angular in Action</strong> par Jeremy Wilken ou <strong>Angular Cookbook</strong> par Matt Frisbie."
                }]
                },
                {
                    "icon": "images/skills/git.png",
                    "title": "Git",
                    "niveau": "PRO",
                    "projects": [
                        "Devmato",
                        "Hypotech",
                        "Maintenance applicative"
                      ],
                      "details": [{
                        "definition": "Git est un système de contrôle de version largement utilisé dans le développement de logiciels. Il permet à une équipe de travailler simultanément sur un projet, de suivre les modifications apportées aux fichiers et de fusionner facilement les différentes branches de développement.\n\nGit est donc un outil particulièrement puissant pour gérer le code source d’un projet. Il permet à plusieurs développeurs de travailler sur le même projet sans se soucier des conflits qui pourraient survenir lors de l’intégration de leurs modifications.",
                        "preuves": "C’est notamment lors de mon cursus à INTECH que j’ai eu l’occasion pour la première fois de me familiariser avec Git. En effet, lors de la réalisation de tous nos projets informatiques, nous avons utilisé Git pour en gérer le code source. C’était une première expérience très enrichissante car elle m’a permis de comprendre comment se servir plus précisément du logiciel. En effet, lorsqu’en équipe nous commencions à travailler sur un projet, il était très important de déterminer quelle structure il allait avoir afin de déterminer quelles branches créer, comment s’organiser pour pousser les nouvelles fonctionnalités et les tester…. Les premiers projets ayant une structure assez simple, je n’ai dans un premier temps pas eu à énormément pousser mes connaissances. Je me souviens très clairement lorsque les projets ont commencé à avoir une structure bien plus complexe que le premier à avoir vraiment mis à l’épreuve mes connaissances était <a href='/reactPortfolio/#/ProjectDetails/Devmato'>Devmato</a>. A cause des connaissances assez basiques que moi et l’équipe avions de Git, il arrivait très régulièrement que des conflits entre les branches se produisent ce qui pouvait causer de grosses pertes de temps. C’est face à cette problématique que j’ai décidé d’analyser en détail la situation, identifier les méthodes que l’on pouvait améliorer et ainsi harmoniser les contributions de chaque membre de l’équipe  ce qui a permis de préserver l’intégrité du code source et fait gagner beaucoup de temps.\n\nLorsque je suis arrivé en <a href='/reactPortfolio/#/ProjectDetails/Maintenance%20applicative'>stage</a> chez Capgemini j’avais donc déjà une expérience de Git venant des différents projets étudiants réalisés précédemment. Malgré cette expérience qui me semblait plutôt avancée à ce stade du cursus, je me suis rendu compte que l’ampleur du projet changeait totalement la donne. En effet, l’organisation du projet était bien plus poussée et stricte et m’a forcé à comprendre encore plus précisément toutes les spécificités qu’offrait le logiciel. Face à cette réalité et fort de mes connaissances précédemment acquises, j’ai contribué à accroître l’efficacité opérationnelle de l’équipe qui se basait sur des méthodes de travail assez anciennes et n’ayant pas beaucoup évolué en raison de sa durée de plus de 20 ans. En effet, j’ai eu l’occasion d’automatiser certains aspects du flux de travail ou encore de proposer des ajustements sur le processus de gestion des branches qui ont permis d’optimiser la traçabilité des modifications apportées au code.\n\nCette expérience chez Capgemini m'a non seulement permis de perfectionner mes compétences techniques, mais elle a également mis en lumière ma capacité à innover et à adapter les pratiques existantes pour répondre aux exigences spécifiques des projets.",
                        "critique": "Ces différentes expériences que j’ai accumulées au fil du temps avec Git me permettent aujourd’hui de me considérer comme confirmé sur cet outil.  En effet, je me sens capable de m’en servir facilement tout en m’adaptant à la structure d’un nouveau projet.\n\nMalgré l’aisance que j’ai développée en utilisant Git, je ne l’utilise pas encore de manière systématique à tous mes projets. Il faut donc que je travaille sur cet aspect afin d’avoir l’habitude d’appliquer systématiquement cette compétence que le projet soit dans un cadre professionnel ou personnel.\n\nAfin d’arriver à cet automatisme, il est nécessaire que je continue à m’entrainer pour gagner toujours plus de connaissances et m’améliorer. C’est pour cela que je conseillerai à tout développeur débutant de s’intéresser à Git et de ne pas hésiter à l’utiliser pour des projets personnels, pour directement prendre des bonnes habitudes avant même de travailler en équipe.",
                        "evolution": "Que ce soit dans l'activité que je pratique actuellement ou dans les potentiels changements qu’elle pourrait avoir dans le futur, Git restera un outil très important et dont je continuerai à me servir. Tout comme SQL, c’est une technologie omniprésente qui a donc une grande importance dans mon projet professionnel. C’est pour cette raison qu’il est important pour moi à moyen terme de continuer à apprendre un maximum sur Git notamment par la lecture de livres très intéressants comme <strong>Git Pocket Guide</strong> de Richard E. Silverman. Il m’arrive aussi régulièrement d’analyser les commits et l’historique de projets open source comme celui de <a href='https://github.com/microsoft/vscode'>Visual Studio Code</a> afin d’étudier la structure et les pratiques de gestion d’autres développeurs."
                }]
                },
                {
                    "icon": "images/skills/archiweb.png",
                    "title": "Architecture web",
                    "niveau": "PRO",
                    "projects": [
                        "Devmato",
                        "Maintenance applicative"
                      ],
                      "details": [{
                        "definition": "L'<strong>architecture web</strong> consiste à concevoir la structure globale d'un système d'information web, en définissant l'organisation des différents éléments qui le composent, tels que les serveurs, les bases de données, les interfaces utilisateur, et les protocoles de communication.\n\nUn architecte web est chargé de concevoir des solutions techniques répondant aux besoins fonctionnels et aux contraintes techniques du projet. Il doit prendre en compte des aspects tels que la scalabilité, la performance, la sécurité et la maintenabilité du système.\n\nAvec la prolifération des réseaux sociaux, des applications mobiles et des services en ligne, l'<strong>architecture web</strong> joue un rôle crucial dans la facilitation de l'accès à l'information et dans la création d'expériences utilisateur fluides et intuitives.\n\nPar exemple, dans le domaine de l'e-commerce, une <strong>architecture web</strong> bien conçue permet de proposer des interfaces utilisateur conviviales, des processus de commande efficaces et des systèmes de paiement sécurisés, contribuant ainsi à améliorer l'expérience d'achat en ligne des consommateurs.",
                        "preuves": "Durant mon cursus à INTECH, j’ai eu l’occasion de découvrir principalement deux modèles d’archcitecture web : le MVC et le MVVM.\n\nLe MVC (Model - View - Controller) est un patron de conception créé par Trygve Reenskaug en 1978. Il permet de séparer les composants d’une application ou d’un site en trois parties interconnectées : Modèle, Vue et Contrôleur. Ces trois parties ont chacune un rôle à remplir et permettent une séparation claire des composants techniques pour faciliter le développement.\n\nLa partie modèle va définir les données à afficher. Chaque élément contient la définition des valeurs à montrer côté client sur les interfaces visibles. Ces valeurs peuvent être des données simples, comme les informations d’un client (nom, prénom, email, etc.), ou des structures de données plus complexes.\n\nLa partie vue contient la représentation de l’interface graphique. C’est dans ces vues que l'on va définir comment doivent s’afficher les éléments visuels de l’application. Les modèles sont utilisés ici afin d’afficher les valeurs qu’ils contiennent dans des boutons ou des champs textes par exemple.\n\nFinalement, la partie contrôleur va contenir la logique derrière les actions effectuées par l'utilisateur. Ce sont eux qui vont manipuler et modifier les données des modèles ou des vues. Par exemple, sur un site d’e-commerce, si un utilisateur veut modifier son adresse de livraison enregistrée, il la changera dans le champ texte d’une vue, et lors de la validation, le contrôleur va effectuer l’action en modifiant le modèle associé à cet utilisateur.\n\nLe MVVM a un concept assez similaire au MVC mais possède tout de même quelques différences. En effet, un intermédiaire est rajouté entre la vue et le modèle : le VueModèle. ll est responsable de la liaison des données entre le Modèle et la Vue, fournissant ainsi à la Vue les données à afficher. Le VueModèle contient également la logique métier et de présentation associée à la Vue, réduisant ainsi la quantité de logique métier dans la Vue elle-même.\n\nLors de mon cursus à INTECH, j’ai eu l’occasion à plusieurs reprises de me confronter à l’architecture web mais un projet en particulier a marqué mon expérience. Il s’agit du projet <a href='/reactPortfolio/#/ProjectDetails/Hypotech'>Hypotech</a>, axé sur le développement d’une application mobile destinée à simplifier les démarches administratives liées à l’immobilier. Dans le cadre de ce projet, j'ai été chargé de la gestion des dossiers immobiliers, des documents associés et de la progression de leur traitement. Cette responsabilité combinait à la fois les aspects front-end pour l’affichage des données mais aussi les aspects back-end fournissant les données à la Vue.\n\nPour mener à bien cette tâche complexe, j’ai approfondi ma compréhension du modèle MVVM qui jusque-là se cantonnait à des bases ne pouvant pas être facilement appliquées à un tel système. C’est en explorant ce modèle en profondeur que j’ai réalisé toute sa pertinence et sa puissance dans le développement d’applications. Grâce à cette nouvelle compréhension, j’ai pu grandement accélérer ma progression sur le projet et développer une vision claire de la structure et du fonctionnement de l’application. Avant ce projet, j’appliquais les modèles d’architecture web de manière machinale, sans vraiment en comprendre l’intérêt mais c’est vraiment face à des défis techniques importants que j’ai su me remettre en question et comprendre pourquoi ces modèles étaient utilisés.",
                        "critique": "Dans un premier temps, j’ai trouvé la mise en place d’une <strong>architecture web</strong> compliquée lors de mes premières expériences : définir à l'avance les intéractions entre les différents composants, choisir les technologies les plus adaptées tout en connaissant tous les besoins de l’application à l'avance n’était pas simple pour moi à assimiler au début.\n\nAvec les différentes expériences que j’ai accumulées au fil de mon cursus, je pense maintenant être autonome et compétent dans la mise en place d’une <strong>architecture web</strong>.\n\nEn tant que développeur, je pense qu’il est très important de savoir comment architecturer une application de manière générale. Il n'est pas obligatoire de faire de l’architecture mais la compréhension générale de l’architecture de l’application aide énormément lors du développement de nouvelles fonctionnalités. C’est pour ces raisons que je conseillerai à n’importe quel développeur de maîtriser cette compétence.",
                        "evolution": "L’architecture web est une compétence qu’il est toujours intéressant de développer mais qui n’occupe pas une place centrale dans mon projet professionnel à moyen terme. Avec les compétences que j'ai acquises jusqu'à présent, je suis satisfait de mon niveau actuel. Cependant, je reste ouvert aux opportunités de formation futures, notamment si un projet sur lequel je travaille nécessite l'utilisation d'une architecture web très différente de celle que j'ai pu rencontrer jusqu'à présent."
                }]
                }
        ]},
        {
            "title": "humaines",
            "items" : [
                {
                    "icon": "images/skills/montage.png",
                    "title": "Montage",
                    "niveau": "INITIE",
                    "projects": [
                        "Mat'moi ça",
                        "Agri'Dax"
                      ],
                      "details": [{
                        "definition": "Le <strong>montage</strong> désigne l’art et la technique d’assembler des séquences vidéo et audio pour créer un produit final cohérent et esthétiquement plaisant. Les monteurs utilisent des logiciels spécialisés pour organiser, couper, synchroniser et corriger les prises de vue et les enregistrements sonores. Cette compétence nécessite une compréhension approfondie de la narration visuelle, du rythme, de la continuité et des techniques de transition. La capacité à comprendre et interpréter les besoins du public est essentielle pour produire un contenu engageant et concrétisant la vision créative du projet.\n\nDans le paysage médiatique contemporain, le <strong>montage</strong> revêt une importance cruciale dans la manipulation et la diffusion de l’information . Avec l’essor des réseaux sociaux et des plateformes de partage de vidéos en ligne, le <strong>montage</strong> est devenu un outil puissant pour façonner les récits et influencer les opinions publiques. Des événements politiques aux manifestations sociales, en passant par les documentaires et les reportages, le <strong>montage</strong> peut être utilisé pour créer des narrations qui amplifient certains aspects de la réalité ou qui la déforment. En analysant les récentes controverses médiatiques, telles que la diffusion de vidéos virales manipulées ou la montée des théories du complot en ligne, il est clair que le <strong>montage</strong> joue un rôle crucial dans la manière dont les informations sont perçues et interprétées par le grand public. Ainsi, le <strong>montage</strong> est un domaine où la responsabilité éthique et la sensibilisation aux enjeux de désinformation sont essentielles pour garantir une représentation précise et équilibrée des événements.",
                        "preuves": "Lors de mon cursus à INTECH, le tout premier projet informatique que j’ai eu à réaliser m’a permis de découvrir cette compétence. En effet, ce projet nous demandait de créer un jeu vidéo éducatif simple qui pourrait être utilisé par des enfants plutôt jeunes. Afin de mettre le jeu en avant et d’expliquer son concept, j’ai dû réaliser une vidéo la plus attrayante possible afin de présenter le jeu. \n\nAu début, je pensais qu’il serait simple de réaliser cette mission car je n’en voyais pas particulièrement la complexité. C’est en me penchant plus sérieusement sur le sujet que je me suis rendu compte de la difficulté que cela représentait. En réalité, je me suis vite aperçu que créer une vidéo attrayante tout en la gardant courte et explicative était compliqué. C’est seulement après de nombreux essais et en demandant l’avis à de nombreuses personnes autour de moi que j’ai réussi à trouver l’équilibre entre la durée, la qualité et la pédagogie qui ont permis à cette vidéo de séduire les utilisateurs et le jury auquel nous avons présenté notre jeu.\n\nCette première expérience autour du <strong>montage</strong> a été très instructive et m’a fait découvrir la difficulté et les enjeux qu’elle pouvait représenter. En effet, je me suis rendu compte de l’importance que représente la présentation d’un projet complexe afin de le faire apprécier à de potentiels clients et utilisateurs.\n\nC’est à nouveau lors de mon cursus à INTECH que je me suis retrouvé confronté une seconde fois à la réalisation d’un <strong>montage</strong>. Durant le semestre 3, j’ai eu à réaliser avec l’aide de trois de mes camarades une <a href='/reactPortfolio/#/ProjectDetails/Agri&#39;Dax'>formation sur un logiciel</a>. Le logiciel sur lequel nous avons dû travailler afin de former les apprenants était particulièrement technique et nous avions pour mission à la fois de créer une formation mais aussi de créer une documentation sous forme de vidéo afin que de futurs apprenants puissent s’y référer en cas de besoin.\n\nJ’ai donc eu en plus de mon rôle de chef de projet la mission de créer cette vidéo explicative. Fort de ma première expérience dans le domaine, il a été bien plus simple pour moi de trouver des idées originales pour être le plus pédagogue possible tout en gardant le public intéressé. La plus grosse difficulté à laquelle j’ai fait face a été la difficulté à m’adapter aux différents feedbacks que j’ai reçus. En effet, j’ai eu l’occasion de présenter mon travail à plusieurs types de public afin d’avoir leur avis et je me suis rendu compte que mes idées ne convenaient pas forcément. J’ai donc dû adapter mon travail à ces retours.\n\nCette deuxième expérience a été très instructive pour moi. Sans aucun doute, elle m’a permis de confirmer et perfectionner mes acquis mais aussi de ne pas me reposer dessus et de toujours me remettre en question.",
                        "critique": "Ces expériences accumulées au fil de mon cursus m’ont permis à la fois de découvrir et de progresser sur mes connaissances du <strong>montage</strong> et je pense aujourd’hui avoir atteint un bon degré d’autonomie à ce niveau.\n\nCette compétence n’est pas celle que j’ai eu l’occasion de mettre le plus en œuvre. Elle a toujours revêtu une grande importance dans les projets ou je l’ai appliquée mais je pense toujours avoir des progrès à faire dans le domaine. En effet, j’ai accumulé une bonne expérience en me formant au fur et à mesure des besoins que je rencontrais mais il est possible de la pousser encore plus loin.\n\nAinsi, avec le recul, je me rends compte de l’importance que représente le <strong>montage</strong> dans la réalisation d’un projet afin de convaincre un maximum de clients et d’utilisateurs. Il me semble donc important d’avoir au minimum les bases de la compétence pour pouvoir les appliquer lorsque c’est nécessaire.",
                        "evolution": "Dans le cadre de mon projet professionnel, bien que le montage vidéo ne soit pas une compétence cruciale, j'apprécie son utilité dans des contextes spécifiques. Ayant atteint un niveau satisfaisant lors de mes expériences antérieures, je ne ressens pas le besoin à court terme de me former davantage sur ce sujet. Cependant, je reste ouvert à l'idée d'utiliser mes compétences en montage lorsque des opportunités se présentent, notamment pour créer du contenu informatif ou de communication visuelle dans le cadre d’un projet. En continuant à intégrer le montage vidéo de manière occasionnelle dans mes projets, je maintiens mes compétences à jour tout en concentrant mes efforts sur les domaines qui revêtent une plus grande importance pour mon développement professionnel."
                }]
                },
                {
                    "icon": "images/skills/gestionprojet.png",
                    "title": "Gestion de projet",
                    "niveau": "PRO",
                    "projects": [
                        "Devmato",
                        "Hypotech",
                        "Maintenance applicative",
                        "Agri'Dax"
                      ],
                      "details": [{
                        "definition": "La <strong>gestion de projet</strong> est l'ensemble des activités visant à planifier, organiser, exécuter et contrôler les différentes étapes d'un projet, depuis sa conception jusqu'à sa livraison finale, dans le but d'atteindre des objectifs spécifiques en termes de qualité, de coûts et de délais. C’est une compétence qui s’applique à tout type de projet, qu’il soit informatique ou d’autres domaines.\n\nCette compétence implique également la coordination des différentes parties prenantes impliquées dans le projet, la gestion des risques et des problèmes, la communication efficace et la gestion des ressources humaines, matérielles et financières.\n\nLa vie professionnelle au quotidien implique d’enchaîner les projets. Ceux-ci peuvent être de tout type allant de la réalisation d’une action formation à la création d’une application mobile par exemple. Quel que soit le projet et son périmètre, une bonne méthode de gestion permettra de le réaliser efficacement.",
                        "preuves": "J’ai été à plusieurs reprises confronté à la <strong>gestion de projet</strong> au cours de mon cursus à INTECH. Durant un semestre, avec 3 autres camarades, nous étions chargés de réaliser une <a href='/reactPortfolio/#/ProjectDetails/Agri&#39;Dax'>action de formation</a>. J’ai eu lors de ce projet à endosser le rôle très important de chef de projet, une première expérience pour moi de la gestion de cette responsabilité et des différents challenges à gérer que cela implique. Ce projet visait à aider une association à former ses membres à l’utilisation d’un nouveau logiciel pour faciliter leur travail.\n\nIl n’était pas simple dans les premières semaines de bien déterminer la méthode efficace pour répartir les rôles avec pertinence tout en maintenant une communication de qualité avec les différentes parties prenantes du projet. J’ai dû apprendre au fur et à mesure de mes erreurs comment communiquer au mieux avec mon équipe.\n\nJ’ai notamment fait face à un contexte exceptionnel durant ce projet, il se déroulait en pleine période de confinement, le premier projet que nous avions à réaliser en étant coupé de tout contact physique avec les autres membres de l’équipe. C’est donc en demandant conseils autour de moi et en adaptant au mieux mes connaissances de la méthode de travail que j’ai finalement réussi avec mes camarades, à réaliser une action de formation de qualité très appréciée par l’entreprise l’ayant demandée, malgré un contexte très particulier.\n\nCe premier projet réalisé en tant que chef de projet a été une occasion formidable de développer mes connaissances à ce sujet et d’apprendre comment faire encore mieux pour les projets suivants. J’ai notamment eu l’occasion de le découvrir peu de temps après avec le projet que nous avons réalisé en semestre 5 : <a href='/reactPortfolio/#/ProjectDetails/Hypotech'>Hypotech</a>.\n\nCe projet, la réalisation d’une application mobile, se passait dans un cadre plutôt différent et m’a donc confronté à de nouvelles problématiques de <strong>gestion de projet</strong>. Les connaissances que j’avais acquises jusqu’ici m’ont permis d’être efficace sur la communication entre les membres de mon équipe et les parties prenantes.\n\nAprès avoir bien avancé sur le projet et arrivant vers la fin du semestre, j’ai dû faire face à une problématique que je n’avais encore jamais rencontré ou envisagé : le commanditaire lors d’une de nos réunions habituelles pour parler de l’avancement du projet, a décidé de totalement changer d’idée sur ce qu’il voulait et cela a été une grosse source de panique dans notre équipe.\nDans un premier temps, j’ai fait l’erreur de trop vouloir accepter ces changements alors qu’il était clair que le temps allait nous manquer. Heureusement, après discussion avec les membres de l’équipe et les conseils des encadrants, j’ai appris à être plus ferme avec notre commanditaire en lui expliquant clairement et honnêtement la situation, ce qu’il a bien compris et nous avons pu terminer sans cette pression supplémentaire.",
                        "critique": "Ces différentes expériences m’ont permis de beaucoup progresser dans la maîtrise de cette compétence dans laquelle j’étais encore très novice avant mon cursus à INTECH.\n\nJ’ai notamment appris au travers de la réalisation de ces différents projets la gestion des différentes ressources humaines, la communication entre toutes les parties prenantes ou encore la gestion des ressources techniques. C’est aussi en réalisant deux projets très différents que je me suis rendu compte de tous les aspects spécifiques auxquels il faut s’adapter pour gérer un projet. Il est donc clair que j’ai beaucoup progressé mais que je peux toujours m’améliorer et perfectionner les méthodes.\n\nAinsi, avec le recul de ces années, je me rends compte du caractère indispensable qu’occupe la <strong>gestion de projet</strong> pour tout ingénieur. Moi qui étais personnellement très peu enjoué à l’idée d’être chef de projet, je le conseillerai aujourd’hui à n’importe qui sans hésiter car c’est pour moi le meilleur moyen de gagner en expérience. Les projets que nous avons réalisés durant notre cursus étant dans un cadre scolaire, ils sont une excellente opportunité pour s'essayer quitte à se tromper afin de se préparer au mieux à la vie dans le monde professionnel.",
                        "evolution": "Dans mon parcours professionnel, je considère la gestion de projet comme une compétence essentielle que je souhaite développer davantage. Bien que j'aie acquis des connaissances solides tout au long de mon cursus académique et de mes premières expériences en entreprise, je suis conscient de l'importance de continuer à explorer différentes méthodes et formations pour améliorer mes compétences en gestion de projet. Il est probable que je sois à l’avenir amené à avoir un rôle mettant plus en pratique la gestion de projet mais à court terme, je n’ai pas prévu de me former . En effet, la gestion de projet est surtout appliquée par le chef de projet et je pense donc dans un premier temps prioriser d’autres compétences plus techniques pour éventuellement progresser vers un rôle à responsabilité plus tard. Cependant, c’est une compétence que je souhaite développer à plus long terme, notamment en apprenant auprès de mon chef de projet mais aussi en lisant des livres comme The Lean Startup d'Eric Ries."
                }]
                },
                {
                    "icon": "images/skills/agile.png",
                    "title": "Agilité",
                    "niveau": "EXPERT",
                    "projects": [
                        "Devmato",
                        "Hypotech",
                        "Maintenance applicative"
                      ],
                      "details": [{
                        "definition": "L'<strong>agilité</strong> en informatique est une approche de développement de logiciels qui met l'accent sur la flexibilité, la collaboration et la réactivité aux changements. Elle se base sur le Manifeste Agile, qui met en avant différentes valeurs.\n\nL'une des valeurs fondamentales de l'<strong>agilité</strong> est de donner la priorité aux individus et à leurs interactions au sein d'une équipe. Au lieu de se concentrer exclusivement sur les processus et les outils, l'<strong>agilité</strong> encourage une communication ouverte et efficace entre les membres de l'équipe. Cela favorise une meilleure compréhension des besoins et des perspectives de chacun, ce qui conduit souvent à des solutions plus créatives et à une amélioration globale de la collaboration.\n\nDe plus, l'<strong>agilité</strong> valorise la création de logiciels opérationnels plutôt que la rédaction de documentations excessivement détaillées. Cela signifie que l'accent est mis sur le développement de solutions concrètes et fonctionnelles, qui peuvent être testées et améliorées rapidement. Plutôt que de passer trop de temps à documenter chaque aspect d'un projet, l'<strong>agilité</strong> préconise une approche pragmatique qui met en avant la livraison de produits concrets et utiles.\n\nUn aspect particulièrement important de cette méthode repose sur la collaboration avec les clients. En effet, dans ce contexte, plutôt que de s'appuyer sur des contrats formels et des spécifications figées, l'<strong>agilité</strong> encourage une interaction continue avec les clients. Cela permet d'ajuster et d'adapter le produit en fonction des besoins changeants, favorisant ainsi la satisfaction et la fidélisation.\nFinalement, il est reconnu que le changement est inévitable. Par conséquent, l'<strong>agilité</strong> met l'accent sur la capacité à s'adapter rapidement aux changements plutôt que de suivre un plan strict à la lettre. Cela signifie que les équipes agiles sont flexibles et réactives, prêtes à ajuster leurs priorités et leurs actions en fonction des nouvelles informations ou des évolutions du marché, ce qui conduit à des résultats plus adaptés et pertinents.\n\nL'<strong>agilité</strong> est mise en pratique par l'utilisation de méthodes de développement itératives et incrémentales, telles que Scrum ou Kanban. Ces méthodes favorisent la collaboration étroite entre les différents membres d'une équipe de développement (développeurs, testeurs, chefs de projet, etc.) et une communication constante avec les clients et les parties prenantes du projet.\nL'objectif de l'<strong>agilité</strong> est de produire des logiciels de haute qualité de manière rapide et flexible, en adaptant constamment la stratégie de développement aux besoins changeants des utilisateurs et du marché. \n\nLe monde professionnel aujourd’hui se base beaucoup sur cette méthode pour réaliser des projets dans le domaine informatique. C’est une méthode qui s’est montrée très efficace et qui est aujourd’hui répandue dans une vaste majorité d’entreprises. C’est donc tout naturellement que j’ai régulièrement été confronté à cette méthode particulière.",
                        "preuves": "Au cours de mon cursus à INTECH, j’ai appris comment fonctionne la méthode agile et comment l’appliquer en situation réelle sur un projet. C’est donc en semestre 4 que sur le projet <a href='/reactPortfolio/#/ProjectDetails/Devmato'>DEVMATO</a> avec 3 autres de mes camarades nous nous sommes lancés dans le développement d’un site web reposant sur une API en nous basant sur la méthode agile pour le réaliser.\n\nC’était pour moi une expérience plutôt nouvelle. Nous avions déjà eu l’occasion de nous essayer à la méthode agile sur de précédents projets, mais celui-ci apparaissait comme étant bien plus complexe et nous a obligé à réellement comprendre pour appliquer au mieux cette méthode.\n\nJe me rappelle qu’au début du projet, nous n'avions pas pris conscience de l'importance des différentes réunions quotidiennes et l’élaboration des différentes tâches à effectuer. Toutes ces premières étapes à réaliser et réunions régulières pouvaient parfois me sembler un peu superflues. C’est seulement lorsque nous avons commencé à vraiment nous concentrer sur le développement que je me suis rendu compte de mon erreur.\n\nLes communications vagues ou incomplètes que nous pouvions avoir lors de nos points quotidiens ont souvent été sources de beaucoup de discutions plus tard, ce qui nous a fait perdre plus de temps, ou encore nos tâches qui n’étaient pas forcément complètes nous ont aussi obligé à revoir parfois nos sprints ou certaines fonctionnalités.\n\nHeureusement, après avoir constaté cela, nous avons rapidement pu comprendre l’importance de la rigueur que demande la méthode agile et beaucoup plus nous concentrer et consacrer du temps à sa bonne application. C’est notamment grâce à ces erreurs que j’ai pu beaucoup progresser dans l’apprentissage de la méthode agile.\n\nLors de mon stage en entreprise chez Capgemini, je me suis rendu compte de l’importance de l’<strong>agilité</strong> dans une entreprise travaillant sur des projets à grande échelle. J’ai été très surpris par une organisation qui semblait très travaillée se reposant sur de nombreux outils de <strong>gestion de projet</strong> mais aussi par les différentes réunions régulières bien plus sérieuses et complètes que ce que nous avions pu voir durant notre cursus.\n\nUn certain temps a été nécessaire pour pouvoir m’adapter à cette méthode appliquée à une bien plus grande équipe (environ 80 personnes) et un bien plus vaste projet. En effet, grâce aux différents projets agile réalisés à INTECH, j’ai accumulé beaucoup de connaissances et une bonne idée de ce à quoi ressemble le déroulé d’un projet agile. Malgré cette préparation, la transition a été assez brutale car travailler sur un projet existant depuis plus d’une dizaine d’années et en apprendre tout le contexte fonctionnel pour en maitriser les tenants et les aboutissants a été un véritable challenge.\n\nAvec l’accompagnement des professionnels sur place et l’application de mes connaissances, j’ai pu tout de même m’adapter assez rapidement à ce nouvel environnement et m’apercevoir de l’utilité qu’avait eu l’apprentissage de l’<strong>agilité</strong>.",
                        "critique": "Ces expériences accumulées au fil des différents projets, tant au niveau scolaire qu’en entreprise m’ont permis d’énormément progresser sur mes connaissances de l’<strong>agilité</strong> et de son application et je pense aujourd’hui avoir atteint un bon degré d’autonomie à ce niveau.\n\nJ’ai notamment appris au travers de la réalisation de ces différents projets l’importance de toutes les actions en dehors du développement qui peuvent paraitre superflues au premier regard mais qui sont en réalité indispensables à la réalisation efficace d’un projet. La diversité des projets que j’ai rencontrés m’a aussi permis de me rendre compte que malgré le caractère général de la méthode agile, le contexte fonctionnel d’un projet aura toujours ses spécificités. Il est donc clair que j’ai beaucoup progressé et je pense aujourd’hui pouvoir m’adapter à n’importe quel projet agile et appliquer cette méthode avec qualité et efficacité.\n\nAinsi, avec le recul, je me rends compte de l’importance capitale que représente l’<strong>agilité</strong> pour tout ingénieur dans ce domaine. Dans un premier temps assez méfiant à l’idée de passer beaucoup de temps à faire autre chose que développer, je me rends compte aujourd’hui que je conseillerai à toute personne souhaitant travailler dans le domaine d’appliquer cette méthode de la manière la plus rigoureuse possible. C’est notamment à l’aide des différents projets réalisés durant mon cursus à INTECH que j’ai pu progresser dans un cadre bienveillant et constructif.",
                        "evolution": "Dans mon projet professionnel, je considère l’agilité comme une compétence de première importance. Tous les projets dans le domaine utilisent l’agilité et c’est pour cela qu’il est nécessaire pour moi de l’appliquer toujours plus rigoureusement et efficacement. Je pense aujourd’hui avoir un niveau intermédiaire dans l'agilité. En effet, j’ai eu l’occasion de beaucoup l’explorer au cours de mes expériences, mais il existe de très nombreuses formes différentes d’agilité. C’est pour cela qu’il m’intéresse à moyen terme d’en apprendre plus mais il me paraît important de me former sur les spécificités du projet sur lequel je travaille. Je pense donc apprendre auprès de mon chef de projet qui est la personne connaissant le mieux la méthode appliquée au projet mais aussi en réalisant les formations proposées par l’entreprise dans laquelle je travaille qui comportent toutes les particularités que l'on ne retrouve pas forcément ailleurs."
                }]
                },
                {
                    "icon": "images/skills/communication.png",
                    "title": "Communication",
                    "niveau": "PRO",
                    "projects": [
                        "Mat'moi ça",
                        "Agri'Dax",
                        "Hypotech"
                      ],
                      "details": [{
                        "definition": "La compétence en communication englobe la capacité à transmettre efficacement des informations, des idées et des émotions à travers divers canaux de communication, tels que l'oral, l'écrit, et le non verbal. Cela inclut également la capacité à écouter activement, à poser des questions pertinentes, à interpréter les signaux sociaux et à s'adapter au style de communication des différentes parties prenantes. Une bonne communication favorise la collaboration, la résolution de problèmes, la prise de décision et le maintien de relations professionnelles saines.\n\nAvec la prolifération des plateformes de médias sociaux et des outils de communication en ligne, il est essentiel de pouvoir communiquer de manière claire, concise et respectueuse dans un environnement numérique. En outre, la pandémie de COVID-19 a mis en évidence l'importance de la communication virtuelle, notamment pour le travail à distance et la gestion des équipes distribuées. Ainsi, la capacité à naviguer efficacement dans ces nouveaux modes de communication tout en maintenant des relations professionnelles solides est devenue une compétence essentielle dans le monde du travail contemporain.",
                        "preuves": "Tout au long de mon parcours d’étudiant, j’ai pu mettre en œuvre cette compétence. Dans tous des projets que j’ai réalisés, la communication a eu une place essentielle. En effet, afin de faire avancer au mieux chaque projet, il était capital d’avoir un échange constructif et un discours adapté que ce soit avec mes camarades de classe, les commanditaires de projets, les professeurs ou encore les clients en entreprise.\n\nUn de mes souvenirs les plus marquants en termes de communication était lors du 3ème semestre de mon cursus à INTECH, lors de la réalisation du projet Agri’Dax. <a href='/reactPortfolio/#/ProjectDetails/Agri&#39;Dax'>Ce projet</a> visait à créer un événement de formation à l’utilisation d’un logiciel pour les membres de l’AMAP de Dax. J’ai été particulièrement marqué car c’était la première fois que je dirigeais une équipe. En effet c’est à ce moment là que je me suis rendu compte de l’importance de la communication. Les interlocuteurs avec lesquels j'interagissais étaient très nombreux : les différents membres de mon équipe, les professeurs de l’école, les membres de l'association ayant demandé le projet, des intervenants externes ainsi que les apprenants lors de la formation. La grande difficulté de ce projet était qu’il fallait réussir à adapter mon discours à tous ces différents interlocuteurs. Le challenge était particulièrement complexe pour une première expérience et j'ai eu du mal à le prendre en main au début. Je me souviens qu’au sein même de l’équipe, j’ai appris à m’adapter à chaque membre afin qu’ils ne prennent pas mal certains propos quand je pouvais être trop direct lorsque les délais devennaient tendus par exemple. La réalisation de la formation était aussi un bond assez déstabilisant autant dans la différence de discours qu'il fallait tenir que dans le côté pédagogique qu’il fallait avoir. Ce projet m’a beaucoup apporté car il regroupe énormément de manières différentes de communiquer et j’ai finalement pu très bien m’en sortir et me servir à nouveau des connaissances accumulées pour mener à bien mes autres projets.",
                        "critique": "En raison de mes diverses expériences, je suis convaincu que la communication demeure la compétence essentielle en entreprise, indépendamment du secteur d'activité. Elle joue un rôle crucial dans le renforcement des liens au sein des équipes et dans la clarification des avancées des projets.\n\nMalgré ma nature plutôt réservée, le développement de mes compétences en communication m'a permis d'accroître ma confiance en moi et d'observer ses effets bénéfiques sur l'ambiance de travail, notamment grâce au partage d'informations et à la collaboration lorsque nécessaire. Au fil de mes années d'études et de travail, j'ai appris à rendre compte de mes activités, à présenter devant un public, ainsi qu'à communiquer sur les plateformes sociales. \n\nJe considère donc que toutes ces expériences me confèrent un niveau solide en communication externe. Cependant, je reconnais que je peux encore progresser dans la communication avec les clients. Bien que mes bases soient solides grâce à mon parcours, je n'ai pas l'occasion d'interagir très souvent avec les clients dans mon entreprise actuelle. Ainsi, je m'efforce de maintenir mes connaissances en me remémorant de temps à autre les méthodes utilisées lors de mes projets à INTECH. Je conseillerai donc à n’importe quel développeur de ne pas hésiter à sortir de leur zone de confort et à communiquer autant que possible.",
                        "evolution": "Pour réussir un projet ou simplement dans le cadre de son travail quotidien , la communication est la clé. En tant que développeur, la communication est obligatoire entre les membres de l’équipe. Nous ne sommes pas dans un monde où chacun reste de son côté et ne s’intéresse qu'à son travail personnel. Cette compétence sera donc toujours capitale dans mon projet professionnel. Je pense que la communication est une compétence qui s’acquiert sur le terrain, c’est pour cela que je m’efforce au quotidien de sortir de ma zone de confort en essayant de communiquer avec un maximum d’interlocuteurs différents et en adaptant mon discours en conséquence."
                }]
                },
                {
                    "icon": "images/skills/evenementiel.png",
                    "title": "Evenementiel",
                    "niveau": "INITIE",
                    "projects": [
                        "Mat'moi ça",
                        "Agri'Dax"
                      ],
                      "details": [{
                        "definition": "L’<strong>événementiel</strong> consiste à planifier, organiser, coordonner et exécuter des événements de toutes sortes, tels que des conférences, des expositions, des mariages, des concerts, des festivals, des foires commerciales, des événements sportifs, des cérémonies, des galas et bien d'autres encore.\n\nCette compétence implique de comprendre les besoins des clients ou des participants, de sélectionner et de gérer les fournisseurs et les prestataires de services, de négocier les contrats, de gérer le budget, de concevoir le programme et le contenu de l'événement, de superviser la logistique et la coordination, de gérer les risques et les imprévus, de gérer les communications et les relations publiques, et de s'assurer que l'événement se déroule sans problème.\n\nL'événementiel nécessite également de posséder des compétences en <strong>gestion de projet</strong>, en résolution de problèmes, en communication interpersonnelle, en leadership, en créativité, en innovation et en adaptabilité pour répondre aux exigences et aux attentes des clients ou des participants, et pour assurer le succès de l'événement.",
                        "preuves": "Durant mon cursus à INTECH, un des projets que j’ai eu à réaliser avec 3 de mes camarades était la réalisation d’un évènement. Ce projet consistait à organiser un tournoi d’échecs caritatif afin de reverser les dons à une association. Ce fut une expérience assez particulière et nouvelle pour moi. En effet, la gestion d’un évènement présente énormément de spécificités que je n’avais jusque-là pas explorées : la gestion du budget, des participants, contacter des influenceurs… Il a donc été compliqué dans un premier temps de bien déterminer le budget et comment nous allions le gérer, comment contacter des sponsors pour récupérer des lots à distribuer et comment trouver un maximum de joueurs.\n\nFinalement, après de longues réflexions sur la manière de gérer cet évènement, nous avons fini par mettre en place une campagne de communication très efficace sur différents réseaux sociaux qui nous a permis de gagner dans un premier temps beaucoup de visibilité et une idée plus précise du public que nous pouvions toucher. De plus, cette communication que nous avons effectuée nous a permis d’obtenir beaucoup plus de crédibilité auprès des différents influenceurs et sponsors que nous avons contactés par la suite.",
                        "critique": "Ce projet a été une expérience très enrichissante pour moi. En effet, c’était un aspect complètement nouveau et différent que je n’avais jusque là pas du tout expérimenté. Il a été dans un premier temps difficile de mettre en place tous ces nouveaux apprentissages, mais une fois compris, ils ont permis de réaliser un événement de qualité. Avec le recul, je pense que c’est une expérience à vivre très enrichissante qui permet de comprendre beaucoup d’enjeux sur la gestion d’un évènement.",
                        "evolution": "Dans mon projet professionnel, l’événementiel n’est pas une compétence que je compte prioriser. J’ai atteint un niveau assez novice dans la compétence qui m’a permis de comprendre les enjeux et les opportunités que pouvait représenter sa maîtrise. En tant que développeur, ce n’est pas un aspect que je pense utiliser souvent dans mon travail, c’est pour cela que je ne compte pas me former sur le sujet. Cependant, les bases que j’ai acquises me permettent de comprendre l’importance qu’à cette compétence dans la promotion de produits, le partage de connaissances ou encore dans la création de liens avec une communauté."
                }]
                }
            ]
        }
]}